[
  {
    "name": "Blade Ward",
    "description": "Take only half the damage from Bludgeoning, Piercing, and Slashing attacks.",
    "school": "Abjuration",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains resistance to Bludgeoning, Piercing, and Slashing damage from weapon attacks for 2 turns.",
    "debuff": ""
  },
  {
    "name": "Resistance",
    "description": "Magically bolster a creature's defences. It receives a +1d4 bonus to Saving Throws.",
    "school": "Abjuration",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Target receives a +1d4 bonus to all Saving Throws for 10 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Armour of Agathys",
    "description": "Gain 5 temporary hit points and deal 5 Cold damage to any creature that hits you with a melee attack.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "5 Cold damage to melee attackers",
    "buff": "Caster gains 5 temporary hit points until Long Rest. When upcast, gain an additional 5 temporary hit points and 5 Cold damage per spell slot level above 1st.",
    "debuff": ""
  },
  {
    "name": "Mage Armour",
    "description": "Protect a target from attacks: increase its Armour Class to 13 + its Dexterity modifier.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target's AC becomes 13 + Dexterity modifier until Long Rest. Target cannot be wearing armor.",
    "debuff": ""
  },
  {
    "name": "Protection from Evil and Good",
    "description": "Protect a creature against aberrations, celestials, elementals, fey, fiends, and undead. The target can't be Charmed, Frightened, or possessed by them, and when these creatures attack it, they do so with disadvantage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains immunity to being Charmed, Frightened, or possessed by certain creature types. Those creatures have Disadvantage on attack rolls against the target. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Sanctuary",
    "description": "Ward yourself or an ally against enemy attacks. Until the affected entity attacks or harms another creature, it cannot be targeted by enemy attacks. However, it can still take damage from spells that influence a large area.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target cannot be targeted by attacks until it attacks or harms another creature. Lasts 10 turns.",
    "debuff": ""
  },
  {
    "name": "Shar's Aegis",
    "description": "Encase yourself with a shimmering field of magic that increases your Armour Class by 2.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Caster's Armour Class increases by 2 until Long Rest. Ends if armor is unequipped.",
    "debuff": ""
  },
  {
    "name": "Shield",
    "description": "When you are about to be hit by an enemy, increase your Armour Class by 5. You take no damage from Magic Missile.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "As a Reaction, caster gains +5 AC until the start of their next turn. Immunity to Magic Missile.",
    "debuff": ""
  },
  {
    "name": "Shield of Faith",
    "description": "Surround a creature with a shimmering field of magic that increases its Armour Class by 2.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains +2 AC until Long Rest. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Tyr's Protection",
    "description": "Protect a creature from attacks: increase its Armour Class by 2.",
    "school": "Abjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains +2 AC until Long Rest. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Aid",
    "description": "Heal your allies and increase their hit point maximum by 5 hit points.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "",
    "buff": "Up to 3 targets regain 5 hit points and their maximum HP increases by 5 until Long Rest. When upcast, gain an additional 5 HP per spell slot level above 2nd.",
    "debuff": ""
  },
  {
    "name": "Arcane Lock",
    "description": "Close a door or container with a magical lock. It can no longer be lockpicked or opened with Knock.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Magically locks a door or container for 10 turns.",
    "debuff": ""
  },
  {
    "name": "Gentle Warding Bond",
    "description": "Ward an ally. They gain Resistance to all damage, and a +1 bonus to their Armour Class and Saving Throws. Each time the warded creature takes damage, the spellcaster takes the same amount of damage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Target ally gains Resistance to all damage, +1 AC, and +1 to Saving Throws until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Lesser Restoration",
    "description": "Cure a creature from disease, poison, paralysis or blindness.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Removes disease, poison, paralysis, or blindness from a creature.",
    "debuff": ""
  },
  {
    "name": "Pass Without Trace",
    "description": "Call forth a veil of shadows and silence that gives you and all nearby companions a +10 bonus to Stealth Checks.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Caster and nearby allies gain +10 to Stealth checks for 10 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Protection from Missiles",
    "description": "Amplify your reflexes to better contend with incoming missiles. Ranged weapon attacks against you have Disadvantage, and their damage is halved.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains Resistance to damage from ranged weapon attacks, and attackers have Disadvantage. Lasts 10 turns.",
    "debuff": ""
  },
  {
    "name": "Protection from Poison",
    "description": "Touch a creature to neutralise all poisons affecting it, grant it Advantage on Saving Throws against being Poisoned, and grant it Resistance to Poison damage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Target cures any poisons affecting it, gains Advantage on saves against being Poisoned, and gains Resistance to Poison damage until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Warding Bond",
    "description": "Ward an ally. They gain Resistance to all damage, and a +1 bonus to their Armour Class and Saving Throws. Each time the warded creature takes damage, the spellcaster takes the same amount of damage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Target ally gains Resistance to all damage, +1 AC, and +1 to Saving Throws until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Beacon of Hope",
    "description": "Your allies will regain the maximum hit points possible when healed. They also gain Advantage on Wisdom Saving Throws and Death Saving Throws.",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Allies within range regain maximum HP from healing, gain Advantage on Wisdom Saves and Death Saves for 10 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Counterspell",
    "description": "Nullify another creature's spell as a reaction. The spell must be 3rd level or lower. If it is higher, you must succeed a Check to nullify it, the difficulty of which is based on the spell's Level.",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "",
    "buff": "As a Reaction, prevents an enemy spell from taking effect. When upcast, automatically counters spells of that level or lower.",
    "debuff": "Enemy spell is negated without effect."
  },
  {
    "name": "Glyph of Warding",
    "description": "Inscribe a circle of arcane glyphs on the ground. When stepped on by an enemy, the selected magical effect will trigger. Choose from Detonation (pushes), Sleep, or elemental damage (Acid, Cold, Fire, Lightning, Thunder).",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "5d8 elemental damage (Acid, Cold, Fire, Lightning, or Thunder) for damaging variants",
    "buff": "",
    "debuff": "Varies by glyph type: Sleep (puts creatures to sleep), Detonation (pushes creatures back), or elemental damage with DEX Save for half. Only one glyph active at a time."
  },
  {
    "name": "Khalid's Gift: Aid",
    "description": "Heal yourself and increase your hit point maximum by 10 hit points.",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Caster regains 10 hit points and maximum HP increases by 10 until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Protection from Energy",
    "description": "Touch a creature to grant it Resistance to Acid, Cold, Fire, Lightning, or Thunder damage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains Resistance to one chosen damage type (Acid, Cold, Fire, Lightning, or Thunder) until Long Rest. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Remove Curse",
    "description": "Touch a creature or object to remove all Curses and Hexes affecting it.",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Removes all curses and hexes from a creature or object.",
    "debuff": ""
  },
  {
    "name": "Shield of Devotion: Aid",
    "description": "Heal yourself and increase your hit points maximum by 10 hit points.",
    "school": "Abjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Caster regains 10 hit points and maximum HP increases by 10 until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Banishment",
    "description": "Temporarily Banish your target to another plane of existence.",
    "school": "Abjuration",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "",
    "buff": "Can be used on allies to temporarily remove them from danger.",
    "debuff": "Target is Banished for 2 turns, unable to act and immune to damage. Requires Concentration. When upcast, target an additional creature per spell slot level above 4th."
  },
  {
    "name": "Death Ward",
    "description": "Protect a creature from death. The next time damage would reduce it to 0 hit points, it remains conscious with 1 hit point left.",
    "school": "Abjuration",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Target automatically survives being reduced to 0 HP once, remaining at 1 HP instead. Lasts until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Freedom of Movement",
    "description": "Snap an ally out of any Stun. Difficult Terrain can't slow them down, and they can't be magically Paralysed or Restrained. If the target is Restrained by non-magical means, it can spend 1.5m of movement to free itself.",
    "school": "Abjuration",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Target is unaffected by Difficult Terrain, cannot be Paralysed or Restrained, and can break non-magical Restraints easily. Lasts until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Gargoyle's Countenance",
    "description": "Become stone, gaining Resistance to non-magical Bludgeoning, Piercing, and Slashing damage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains Resistance to non-magical Bludgeoning, Piercing, and Slashing damage for 10 turns.",
    "debuff": ""
  },
  {
    "name": "Stoneskin",
    "description": "Turn a creature's flesh hard as stone. It takes only half the damage of all non-magical Bludgeoning, Piercing, and Slashing damage.",
    "school": "Abjuration",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains Resistance to non-magical Bludgeoning, Piercing, and Slashing damage until Long Rest. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Dispel Evil and Good",
    "description": "Aberrations, celestials, elementals, fey, fiends, and undead have Disadvantage on Attack Rolls against you. You can also Break Enchantments that Charm, Frighten, or Possess allies.",
    "school": "Abjuration",
    "type": "spell",
    "level": 5,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains protection against certain creature types for 10 turns. Can end enchantment effects on allies.",
    "debuff": "Certain creature types have Disadvantage on attack rolls against caster."
  },
  {
    "name": "Greater Restoration",
    "description": "Touch a creature and negate any Charm, Petrification, Stun, or curse afflicting it.",
    "school": "Abjuration",
    "type": "spell",
    "level": 5,
    "upcastable": false,
    "damage": "",
    "buff": "Removes Charm, Petrification, Stun, curses, ability score reductions, and exhaustion from a creature.",
    "debuff": ""
  },
  {
    "name": "Planar Binding",
    "description": "Target an otherworldly creature (celestial, elemental, fey, or fiend) and attach its consciousness to your own. It will follow and fight for you as an ally.",
    "school": "Abjuration",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "",
    "buff": "Forces a celestial, elemental, fey, or fiend to fight for you for 10 turns if it fails a WIS Save. When upcast, duration extends.",
    "debuff": ""
  },
  {
    "name": "Globe of Invulnerability",
    "description": "Creates a barrier that makes creatures and objects inside it Immune to all damage from spells of 5th level or lower.",
    "school": "Abjuration",
    "type": "spell",
    "level": 6,
    "upcastable": true,
    "damage": "",
    "buff": "Creates a 3m radius globe where creatures and objects are immune to spell damage of 5th level or lower for 3 turns. When upcast, immunity threshold increases.",
    "debuff": ""
  },
  {
    "name": "Symbol",
    "description": "Set the trigger and the effect of a glyph on an object. Effects include death, discord, fear, hopelessness, insanity, pain, or sleep.",
    "school": "Abjuration",
    "type": "spell",
    "level": 7,
    "upcastable": false,
    "damage": "Varies by effect",
    "buff": "",
    "debuff": "Triggers a powerful magical effect when creatures approach the inscribed object."
  }
]