{
    "Abjuration":  [
                       {
                           "name":  "Blade Ward",
                           "description":  "Take only half the damage from Bludgeoning, Piercing, and Slashing attacks.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  0,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster gains resistance to Bludgeoning, Piercing, and Slashing damage from weapon attacks for 2 turns.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Resistance",
                           "description":  "Magically bolster a creature\u0027s defences. It receives a +1d4 bonus to Saving Throws.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  0,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target receives a +1d4 bonus to all Saving Throws for 10 turns. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Armour of Agathys",
                           "description":  "Gain 5 temporary hit points and deal 5 Cold damage to any creature that hits you with a melee attack.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  true,
                           "damage":  "5 Cold damage to melee attackers",
                           "buff":  "Caster gains 5 temporary hit points until Long Rest. When upcast, gain an additional 5 temporary hit points and 5 Cold damage per spell slot level above 1st.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Mage Armour",
                           "description":  "Protect a target from attacks: increase its Armour Class to 13 + its Dexterity modifier.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target\u0027s AC becomes 13 + Dexterity modifier until Long Rest. Target cannot be wearing armor.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Protection from Evil and Good",
                           "description":  "Protect a creature against aberrations, celestials, elementals, fey, fiends, and undead. The target can\u0027t be Charmed, Frightened, or possessed by them, and when these creatures attack it, they do so with disadvantage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target gains immunity to being Charmed, Frightened, or possessed by certain creature types. Those creatures have Disadvantage on attack rolls against the target. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Sanctuary",
                           "description":  "Ward yourself or an ally against enemy attacks. Until the affected entity attacks or harms another creature, it cannot be targeted by enemy attacks. However, it can still take damage from spells that influence a large area.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target cannot be targeted by attacks until it attacks or harms another creature. Lasts 10 turns.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Shar\u0027s Aegis",
                           "description":  "Encase yourself with a shimmering field of magic that increases your Armour Class by 2.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster\u0027s Armour Class increases by 2 until Long Rest. Ends if armor is unequipped.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Shield",
                           "description":  "When you are about to be hit by an enemy, increase your Armour Class by 5. You take no damage from Magic Missile.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "As a Reaction, caster gains +5 AC until the start of their next turn. Immunity to Magic Missile.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Shield of Faith",
                           "description":  "Surround a creature with a shimmering field of magic that increases its Armour Class by 2.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target gains +2 AC until Long Rest. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Tyr\u0027s Protection",
                           "description":  "Protect a creature from attacks: increase its Armour Class by 2.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target gains +2 AC until Long Rest. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Aid",
                           "description":  "Heal your allies and increase their hit point maximum by 5 hit points.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "Up to 3 targets regain 5 hit points and their maximum HP increases by 5 until Long Rest. When upcast, gain an additional 5 HP per spell slot level above 2nd.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Arcane Lock",
                           "description":  "Close a door or container with a magical lock. It can no longer be lockpicked or opened with Knock.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Magically locks a door or container for 10 turns.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Gentle Warding Bond",
                           "description":  "Ward an ally. They gain Resistance to all damage, and a +1 bonus to their Armour Class and Saving Throws. Each time the warded creature takes damage, the spellcaster takes the same amount of damage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target ally gains Resistance to all damage, +1 AC, and +1 to Saving Throws until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Lesser Restoration",
                           "description":  "Cure a creature from disease, poison, paralysis or blindness.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Removes disease, poison, paralysis, or blindness from a creature.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Pass Without Trace",
                           "description":  "Call forth a veil of shadows and silence that gives you and all nearby companions a +10 bonus to Stealth Checks.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster and nearby allies gain +10 to Stealth checks for 10 turns. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Protection from Missiles",
                           "description":  "Amplify your reflexes to better contend with incoming missiles. Ranged weapon attacks against you have Disadvantage, and their damage is halved.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster gains Resistance to damage from ranged weapon attacks, and attackers have Disadvantage. Lasts 10 turns.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Protection from Poison",
                           "description":  "Touch a creature to neutralise all poisons affecting it, grant it Advantage on Saving Throws against being Poisoned, and grant it Resistance to Poison damage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target cures any poisons affecting it, gains Advantage on saves against being Poisoned, and gains Resistance to Poison damage until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Warding Bond",
                           "description":  "Ward an ally. They gain Resistance to all damage, and a +1 bonus to their Armour Class and Saving Throws. Each time the warded creature takes damage, the spellcaster takes the same amount of damage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target ally gains Resistance to all damage, +1 AC, and +1 to Saving Throws until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Beacon of Hope",
                           "description":  "Your allies will regain the maximum hit points possible when healed. They also gain Advantage on Wisdom Saving Throws and Death Saving Throws.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Allies within range regain maximum HP from healing, gain Advantage on Wisdom Saves and Death Saves for 10 turns. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Counterspell",
                           "description":  "Nullify another creature\u0027s spell as a reaction. The spell must be 3rd level or lower. If it is higher, you must succeed a Check to nullify it, the difficulty of which is based on the spell\u0027s Level.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "As a Reaction, prevents an enemy spell from taking effect. When upcast, automatically counters spells of that level or lower.",
                           "debuff":  "Enemy spell is negated without effect."
                       },
                       {
                           "name":  "Glyph of Warding",
                           "description":  "Inscribe a circle of arcane glyphs on the ground. When stepped on by an enemy, the selected magical effect will trigger. Choose from Detonation (pushes), Sleep, or elemental damage (Acid, Cold, Fire, Lightning, Thunder).",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  true,
                           "damage":  "5d8 elemental damage (Acid, Cold, Fire, Lightning, or Thunder) for damaging variants",
                           "buff":  "",
                           "debuff":  "Varies by glyph type: Sleep (puts creatures to sleep), Detonation (pushes creatures back), or elemental damage with DEX Save for half. Only one glyph active at a time."
                       },
                       {
                           "name":  "Khalid\u0027s Gift: Aid",
                           "description":  "Heal yourself and increase your hit point maximum by 10 hit points.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster regains 10 hit points and maximum HP increases by 10 until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Protection from Energy",
                           "description":  "Touch a creature to grant it Resistance to Acid, Cold, Fire, Lightning, or Thunder damage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target gains Resistance to one chosen damage type (Acid, Cold, Fire, Lightning, or Thunder) until Long Rest. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Remove Curse",
                           "description":  "Touch a creature or object to remove all Curses and Hexes affecting it.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Removes all curses and hexes from a creature or object.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Shield of Devotion: Aid",
                           "description":  "Heal yourself and increase your hit points maximum by 10 hit points.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster regains 10 hit points and maximum HP increases by 10 until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Banishment",
                           "description":  "Temporarily Banish your target to another plane of existence.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  4,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "Can be used on allies to temporarily remove them from danger.",
                           "debuff":  "Target is Banished for 2 turns, unable to act and immune to damage. Requires Concentration. When upcast, target an additional creature per spell slot level above 4th."
                       },
                       {
                           "name":  "Death Ward",
                           "description":  "Protect a creature from death. The next time damage would reduce it to 0 hit points, it remains conscious with 1 hit point left.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  4,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target automatically survives being reduced to 0 HP once, remaining at 1 HP instead. Lasts until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Freedom of Movement",
                           "description":  "Snap an ally out of any Stun. Difficult Terrain can\u0027t slow them down, and they can\u0027t be magically Paralysed or Restrained. If the target is Restrained by non-magical means, it can spend 1.5m of movement to free itself.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  4,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target is unaffected by Difficult Terrain, cannot be Paralysed or Restrained, and can break non-magical Restraints easily. Lasts until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Gargoyle\u0027s Countenance",
                           "description":  "Become stone, gaining Resistance to non-magical Bludgeoning, Piercing, and Slashing damage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  4,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster gains Resistance to non-magical Bludgeoning, Piercing, and Slashing damage for 10 turns.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Stoneskin",
                           "description":  "Turn a creature\u0027s flesh hard as stone. It takes only half the damage of all non-magical Bludgeoning, Piercing, and Slashing damage.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  4,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target gains Resistance to non-magical Bludgeoning, Piercing, and Slashing damage until Long Rest. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Dispel Evil and Good",
                           "description":  "Aberrations, celestials, elementals, fey, fiends, and undead have Disadvantage on Attack Rolls against you. You can also Break Enchantments that Charm, Frighten, or Possess allies.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  5,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster gains protection against certain creature types for 10 turns. Can end enchantment effects on allies.",
                           "debuff":  "Certain creature types have Disadvantage on attack rolls against caster."
                       },
                       {
                           "name":  "Greater Restoration",
                           "description":  "Touch a creature and negate any Charm, Petrification, Stun, or curse afflicting it.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  5,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Removes Charm, Petrification, Stun, curses, ability score reductions, and exhaustion from a creature.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Planar Binding",
                           "description":  "Target an otherworldly creature (celestial, elemental, fey, or fiend) and attach its consciousness to your own. It will follow and fight for you as an ally.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  5,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "Forces a celestial, elemental, fey, or fiend to fight for you for 10 turns if it fails a WIS Save. When upcast, duration extends.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Globe of Invulnerability",
                           "description":  "Creates a barrier that makes creatures and objects inside it Immune to all damage from spells of 5th level or lower.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  6,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "Creates a 3m radius globe where creatures and objects are immune to spell damage of 5th level or lower for 3 turns. When upcast, immunity threshold increases.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Symbol",
                           "description":  "Set the trigger and the effect of a glyph on an object. Effects include death, discord, fear, hopelessness, insanity, pain, or sleep.",
                           "school":  "Abjuration",
                           "type":  "spell",
                           "level":  7,
                           "upcastable":  false,
                           "damage":  "Varies by effect",
                           "buff":  "",
                           "debuff":  "Triggers a powerful magical effect when creatures approach the inscribed object."
                       }
                   ],
    "Conjuration":  [
                        {
                            "name":  "Acid Splash",
                            "description":  "Hurl a bubble of acid that deals 1d6 Acid damage to each creature it hits in a small area.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  0,
                            "upcastable":  false,
                            "damage":  "1d6 Acid",
                            "buff":  "",
                            "debuff":  ""
                        },
                        {
                            "name":  "Mage Hand",
                            "description":  "Create a spectral hand that can manipulate and interact with objects.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  0,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Summons an invisible hand that can interact with objects, use items, and throw things for 10 turns.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Poison Spray",
                            "description":  "Project a puff of noxious gas that deals 1d12 Poison damage.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  0,
                            "upcastable":  false,
                            "damage":  "1d12 Poison",
                            "buff":  "",
                            "debuff":  ""
                        },
                        {
                            "name":  "Produce Flame",
                            "description":  "A flickering flame appears in your hand. It sheds bright light in a 9m / 30ft radius and deals 1d8 Fire damage when thrown.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  0,
                            "upcastable":  false,
                            "damage":  "1d8 Fire (when thrown)",
                            "buff":  "Provides light in a 9m / 30ft radius.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Arms of Hadar",
                            "description":  "Call forth tendrils of dark energy that deal 2d6 Necrotic damage and prevent targets from taking Reactions.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "2d6 Necrotic",
                            "buff":  "",
                            "debuff":  "Targets cannot take Reactions until their next turn."
                        },
                        {
                            "name":  "Ensnaring Strike",
                            "description":  "Your attack summons thorny vines, dealing weapon damage and possibly Ensnaring your target. Ensnared creatures cannot move and take 1d6 Piercing damage at the start of each turn.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "Weapon damage + 1d6 Piercing (ongoing)",
                            "buff":  "",
                            "debuff":  "Target may become Ensnared, unable to move and taking ongoing Piercing damage. An ally can use Help to free them."
                        },
                        {
                            "name":  "Entangle",
                            "description":  "Vines sprout from the ground, turning it into Difficult Terrain and possibly Entangling creatures within. Entangled creatures cannot move.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Creatures in area may become Entangled (cannot move). Area is Difficult Terrain. Requires Concentration."
                        },
                        {
                            "name":  "Find Familiar",
                            "description":  "Summon a familiar, a fey spirit that takes an animal form of your choosing.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "Varies by familiar (typically 1-4 damage)",
                            "buff":  "Summons an animal companion that can fight, scout, and provide utility out of combat.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Fog Cloud",
                            "description":  "Create a cloud of dense fog that Heavily Obscures and Blinds creatures within.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Can obscure your party from enemy ranged attacks.",
                            "debuff":  "Creates an area that Heavily Obscures and Blinds creatures inside. Requires Concentration."
                        },
                        {
                            "name":  "Grease",
                            "description":  "Cover the ground in grease, slowing creatures within and possibly making them fall Prone.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Area becomes Difficult Terrain. Creatures may fall Prone (Dex Save). The grease is flammable."
                        },
                        {
                            "name":  "Hail of Thorns",
                            "description":  "Shoot a volley of thorns that deals weapon damage to the target and explodes, dealing an additional 1d10 Piercing damage to the target and surrounding creatures.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "Weapon damage + 1d10 Piercing (AoE)",
                            "buff":  "",
                            "debuff":  ""
                        },
                        {
                            "name":  "Ice Knife",
                            "description":  "Throw a shard of ice that deals 1d10 Piercing damage. It explodes and deals 2d6 Cold damage to anyone nearby, leaving an ice surface.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "1d10 Piercing + 2d6 Cold (AoE)",
                            "buff":  "",
                            "debuff":  "Creates an ice surface that may cause creatures to fall Prone."
                        },
                        {
                            "name":  "Cloud of Daggers",
                            "description":  "Conjure a cloud of spinning daggers that attack anyone inside, dealing 4d4 Slashing damage each turn.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  true,
                            "damage":  "4d4 Slashing per turn",
                            "buff":  "",
                            "debuff":  "Creates a damaging area that lasts for 10 turns."
                        },
                        {
                            "name":  "Flaming Sphere",
                            "description":  "Summon a flaming sphere that deals 2d6 Fire damage to nearby enemies and objects. You can move the sphere. It sheds bright light.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  true,
                            "damage":  "2d6 Fire (when ramming enemies)",
                            "buff":  "Summons a controllable sphere that provides light and damages enemies. Requires Concentration.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Misty Step",
                            "description":  "Surrounded by silver mist, you teleport to an unoccupied space you can see within 18m / 60ft.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Allows the caster to instantly teleport to a nearby, visible location as a Bonus Action.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Web",
                            "description":  "Cover an area in thick, flammable webbing that can Enweb creatures within, preventing them from moving.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Creates webbing that slows creatures and may Enweb them. The webbing is flammable. Requires Concentration."
                        },
                        {
                            "name":  "Call Lightning",
                            "description":  "Call down lightning to hit all targets within range for 3d10 Lightning damage. Then for 10 turns, you can call down lightning again without expending a spell slot.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  3,
                            "upcastable":  true,
                            "damage":  "3d10 Lightning",
                            "buff":  "",
                            "debuff":  "Requires Concentration."
                        },
                        {
                            "name":  "Conjure Barrage",
                            "description":  "Channel your weapon\u0027s essence into a destructive, widespread volley, dealing weapon damage plus an additional 2d8 damage of the same type to enemies in a cone.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  3,
                            "upcastable":  true,
                            "damage":  "Weapon damage + 2d8 (same type as weapon)",
                            "buff":  "",
                            "debuff":  ""
                        },
                        {
                            "name":  "Hunger of Hadar",
                            "description":  "Creatures within this black sphere are Blinded and take damage. Creatures starting their turn in the area take 2d6 Cold damage. Creatures ending their turn in the area possibly take 2d6 Acid damage. The area is Difficult Terrain.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  3,
                            "upcastable":  true,
                            "damage":  "2d6 Cold (start of turn) + 2d6 Acid (end of turn)",
                            "buff":  "",
                            "debuff":  "Creates an area that Blinds creatures, damages them, and is Difficult Terrain. Requires Concentration."
                        },
                        {
                            "name":  "Sleet Storm",
                            "description":  "Call forth a storm that douses fires, creates an ice surface, and forces spellcasters to make Concentration saves. Ice surfaces may cause creatures to fall Prone.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  3,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Creates ice surface (Difficult Terrain, may cause Prone). Disrupts Concentration. Requires Concentration."
                        },
                        {
                            "name":  "Spirit Guardians",
                            "description":  "Call forth spirits to protect you. Nearby enemies take 3d8 Radiant or Necrotic damage per turn, and their Movement Speed is halved.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  3,
                            "upcastable":  true,
                            "damage":  "3d8 Radiant or Necrotic per turn",
                            "buff":  "Protects the caster with spirits that damage nearby enemies.",
                            "debuff":  "Enemies in range have their Movement Speed halved. Requires Concentration."
                        },
                        {
                            "name":  "Stinking Cloud",
                            "description":  "Create a cloud of gas so nauseating it prevents creatures from taking actions if they fail a Constitution Saving Throw.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  3,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Creates a cloud that may prevent creatures from taking actions. Requires Concentration."
                        },
                        {
                            "name":  "Conjure Minor Elemental",
                            "description":  "Conjure a minor elemental to fight alongside you. Choose between an Azer, two Ice Mephits, or two Mud Mephits.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  true,
                            "damage":  "Varies by summon (Azer: 1d10+3 Bludgeoning +1d6 Fire; Ice Mephits: 1d4+1 Slashing +2d6 Cold; Mud Mephits: 3d6+1 Bludgeoning)",
                            "buff":  "Summons elemental allies that fight for you.",
                            "debuff":  "Summons may apply conditions: Ice Mephits can create ice surfaces; Mud Mephits can Restrain enemies."
                        },
                        {
                            "name":  "Conjure Woodland Being",
                            "description":  "Conjure a dryad to fight alongside you. She can use Nature\u0027s Step, Entangle enemies, and summon a Wood Woad.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  true,
                            "damage":  "Varies by summon",
                            "buff":  "Summons a dryad ally with powerful support and summoning abilities.",
                            "debuff":  "Dryad can Entangle enemies."
                        },
                        {
                            "name":  "Dimension Door",
                            "description":  "Teleport yourself and up to one adjacent ally to a place you can see. The ally cannot be larger than Medium.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Allows the caster and one ally to teleport to any visible location.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Evard\u0027s Black Tentacles",
                            "description":  "Tentacles sprout from the ground, turning the area into Difficult Terrain, attacking and Smothering creatures within.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  true,
                            "damage":  "Ongoing damage to creatures in area",
                            "buff":  "",
                            "debuff":  "Creates an area of tentacles that damage and Restrain creatures. Requires Concentration."
                        },
                        {
                            "name":  "Grasping Vine",
                            "description":  "Summon a giant vine capable of dragging creatures toward itself.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Vine pulls creatures toward it. Requires Concentration."
                        },
                        {
                            "name":  "Guardian of Faith",
                            "description":  "Call forth a divine guardian that attacks nearby enemies. Every time it deals damage, the guardian loses an equal amount of hit points.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  true,
                            "damage":  "20 Radiant per attack",
                            "buff":  "Summons a stationary guardian that attacks enemies that come near.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Cloudkill",
                            "description":  "Craft a large cloud that inflicts 5d8 Poison damage per turn. You can reposition the cloud every turn. The cloud Heavily Obscures everything within it.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  5,
                            "upcastable":  true,
                            "damage":  "5d8 Poison per turn",
                            "buff":  "",
                            "debuff":  "Creates a movable poison cloud that damages and obscures. Requires Concentration."
                        },
                        {
                            "name":  "Conjure Elemental",
                            "description":  "Bend the barrier between the Planes until they disgorge an elemental ally to follow and fight for you. Choose from Air, Earth, Fire, or Water Elementals, or their more powerful Myrmidon forms.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  5,
                            "upcastable":  true,
                            "damage":  "Varies by elemental (typically 2d8 + elemental damage)",
                            "buff":  "Summons a powerful elemental ally to fight for you.",
                            "debuff":  "Elementals can apply various conditions (Burn, Chilled, Prone, etc.). Requires Concentration."
                        },
                        {
                            "name":  "Insect Plague",
                            "description":  "Locusts attack everyone within range, deal 4d10 Piercing damage, make the area Difficult Terrain, and impose Disadvantage on Perception Checks.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  5,
                            "upcastable":  true,
                            "damage":  "4d10 Piercing",
                            "buff":  "",
                            "debuff":  "Creates a damaging area that is Difficult Terrain and impairs Perception. Requires Concentration."
                        },
                        {
                            "name":  "Arcane Gate",
                            "description":  "Create two linked teleportation portals within range. All creatures, including enemies, may travel between the two portals as a free action.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  6,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Creates portals for strategic movement and positioning.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Heroes\u0027 Feast",
                            "description":  "You and everyone around can\u0027t be Poisoned, Diseased, or Frightened. Maximum Hit Points increase by 2d10, and they make Wisdom Saving Throws with Advantage.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  6,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Allies gain immunity to Poison, Disease, and Frightened; +2d10 max HP; Advantage on Wisdom Saves.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Planar Ally",
                            "description":  "Beseech one of these otherworldly entities for aid. Summon either a Deva, Djinni, or Cambion to fight for you until a Long Rest.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  6,
                            "upcastable":  false,
                            "damage":  "Varies by ally",
                            "buff":  "Summons a powerful celestial, elemental, or fiendish ally to fight for you until Long Rest.",
                            "debuff":  "Allies can apply various conditions to enemies."
                        },
                        {
                            "name":  "Wall of Thorns",
                            "description":  "Create a wall of pliable, twisting thorns. Creatures can move through the wall, but take 7d8 Piercing damage per turn, their Movement Speed is quartered, and they may become Entangled.",
                            "school":  "Conjuration",
                            "type":  "spell",
                            "level":  6,
                            "upcastable":  true,
                            "damage":  "7d8 Piercing per turn (when moving through)",
                            "buff":  "",
                            "debuff":  "Creates a damaging barrier that slows movement and may Entangle. Requires Concentration."
                        }
                    ],
    "Divination":  [
                       {
                           "name":  "Guidance",
                           "description":  "The target gains a +1d4 bonus to Ability Checks.",
                           "school":  "Divination",
                           "type":  "spell",
                           "level":  0,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target receives a +1d4 bonus to all Ability Checks for 10 turns. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "True Strike",
                           "description":  "Divine a character\u0027s defences to give you Advantage on your next Attack Roll against it.",
                           "school":  "Divination",
                           "type":  "spell",
                           "level":  0,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster gains Advantage on their next Attack Roll against the target. Lasts 2 turns. Requires Concentration.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Hunter\u0027s Mark",
                           "description":  "Mark a creature as your quarry to deal an additional 1d6 Slashing damage whenever you hit it with a weapon attack. If the target dies before the spell ends, you can mark a new creature without expending a Spell Slot.",
                           "school":  "Divination",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  true,
                           "damage":  "Weapon attacks deal an extra 1d6 Slashing damage to the marked target",
                           "buff":  "",
                           "debuff":  "Target is marked, taking bonus damage from weapon attacks. Lasts until Long Rest. Requires Concentration. When upcast, duration extends and can be maintained without Concentration at higher levels."
                       },
                       {
                           "name":  "Speak with Animals",
                           "description":  "Gain the ability to comprehend and verbally communicate with beasts.",
                           "school":  "Divination",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster can understand and communicate with animals until Long Rest. Ritual spell - can be cast without expending a spell slot outside combat.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Detect Thoughts",
                           "description":  "Focus your mind to read the thoughts of certain creatures while talking to them.",
                           "school":  "Divination",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Allows caster to read minds during dialogue, revealing lies and secrets. Lasts until Long Rest. Requires Concentration. Ritual spell - can be cast without expending a spell slot outside combat.",
                           "debuff":  ""
                       },
                       {
                           "name":  "See Invisibility",
                           "description":  "Become able to see Invisible creatures, and possibly reveal them to others.",
                           "school":  "Divination",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Caster can see invisible creatures within 9m for 10 turns. Affected creatures may be revealed to all allies.",
                           "debuff":  "Invisible creatures within range are revealed and lose benefits of invisibility."
                       }
                   ],
    "Enchantment":  [
                        {
                            "name":  "Friends",
                            "description":  "Gain Advantage on Charisma Checks against a non-hostile creature. In higher difficulty modes, the target might accuse you of enchanting them.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  0,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Caster gains Advantage on Charisma checks against the target for 10 turns.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Vicious Mockery",
                            "description":  "Insult a creature: it has Disadvantage on its next Attack Roll.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  0,
                            "upcastable":  false,
                            "damage":  "1d4 Psychic",
                            "buff":  "",
                            "debuff":  "Target has Disadvantage on its next Attack Roll. Lasts 1 turn."
                        },
                        {
                            "name":  "Animal Friendship",
                            "description":  "Convince a beast not to attack you.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target beast cannot attack you for 10 turns."
                        },
                        {
                            "name":  "Bane",
                            "description":  "Up to 3 creatures receive a -1d4 penalty to Attack Rolls and Saving Throws.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Up to 3 targets suffer -1d4 penalty to Attack Rolls and Saving Throws for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 1st."
                        },
                        {
                            "name":  "Bless",
                            "description":  "Bless up to 3 creatures. They gain a +1d4 bonus to Attack Rolls and Saving Throws.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "Up to 3 allies gain +1d4 bonus to Attack Rolls and Saving Throws for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 1st.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Challenge to Duel",
                            "description":  "Challenge an enemy to attack only you, inflicting Bleeding on the target.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target is forced to attack only the caster for 3 turns and suffers Bleeding."
                        },
                        {
                            "name":  "Charm Person",
                            "description":  "Charm a humanoid to prevent it from attacking you. You gain Advantage on Charisma Checks in dialogue and prevent it from attacking.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "Caster gains Advantage on Charisma checks against the target in dialogue.",
                            "debuff":  "Target humanoid is Charmed and cannot attack you for 10 turns. When upcast, target an additional humanoid per spell slot level above 1st."
                        },
                        {
                            "name":  "Command",
                            "description":  "Command a creature to flee, move closer, freeze, drop to the ground or drop their weapon.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target must obey a single-word command for 1 turn. When upcast, target an additional creature per spell slot level above 1st."
                        },
                        {
                            "name":  "Compelled Duel",
                            "description":  "Compel an enemy to attack only you. It cannot attack other creatures.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target is forced to attack only the caster for 3 turns."
                        },
                        {
                            "name":  "Dissonant Whispers",
                            "description":  "Whisper a discordant melody to a creature and Frighten it.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "3d6 Psychic",
                            "buff":  "",
                            "debuff":  "Target is Frightened for 2 turns. When upcast, deal an additional 1d6 Psychic damage per spell slot level above 1st."
                        },
                        {
                            "name":  "Exhort the Risen",
                            "description":  "Subjugate the undead with your commands.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Commands an undead creature to obey you."
                        },
                        {
                            "name":  "Heroism",
                            "description":  "Make yourself or a target immune to Frightened and gain 5 temporary hit points each turn.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "Target becomes immune to Frightened and gains 5 temporary HP each turn for 10 turns. Requires Concentration. When upcast, gain an additional 5 temporary HP per turn per spell slot level above 1st.",
                            "debuff":  ""
                        },
                        {
                            "name":  "Hex",
                            "description":  "Curse a creature so it takes additional damage whenever you attack it and to inflict Disadvantage on Ability Checks with an Ability of your choosing.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "1d6 Necrotic (when you attack the target)",
                            "buff":  "",
                            "debuff":  "Target suffers Disadvantage on chosen Ability Checks and takes bonus Necrotic damage from your attacks. Lasts until Long Rest. Requires Concentration. When upcast, duration extends."
                        },
                        {
                            "name":  "Sleep",
                            "description":  "Put creatures into a magical slumber. Select targets up to a combined 24 hit points.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Creatures with total HP up to 24 fall asleep for 2 turns. When upcast, affect an additional 7 HP worth of creatures per spell slot level above 1st."
                        },
                        {
                            "name":  "Tasha\u0027s Hideous Laughter",
                            "description":  "Inflict a creature with fits of laughter, leaving it Prone without the ability to get up.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  1,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target falls Prone and is Incapacitated for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 1st."
                        },
                        {
                            "name":  "Calm Emotions",
                            "description":  "Humanoids can\u0027t be Charmed, Frightened, or become enraged.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "Allies in area become immune to being Charmed or Frightened for 10 turns.",
                            "debuff":  "Enemies in area cannot be enraged. Requires Concentration."
                        },
                        {
                            "name":  "Crown of Madness",
                            "description":  "Instil madness in a humanoid enemy, making them attack the creature closest to them (other than you), even if it\u0027s allied.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target humanoid attacks the nearest creature (excluding caster) for 3 turns. Requires Concentration."
                        },
                        {
                            "name":  "Enthrall",
                            "description":  "Reduce a creature\u0027s peripheral vision and make it look at you.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target has Disadvantage on Perception checks for 10 turns. Requires Concentration."
                        },
                        {
                            "name":  "Hold Person",
                            "description":  "Hold a humanoid enemy still. They can\u0027t move, act or react. Attacks from within 3m are always Critical Hits.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  2,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target humanoid is Paralyzed for 10 turns. Attacks from within 3m are automatic Critical Hits. Requires Concentration. When upcast, target an additional humanoid per spell slot level above 2nd."
                        },
                        {
                            "name":  "Confusion",
                            "description":  "Befuddle a group of creatures, causing them to attack at random, wander around aimlessly, and occasionally skip turns in the stupor.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Creatures in area become Confused for 3 turns, acting randomly. Requires Concentration. When upcast, increase the radius."
                        },
                        {
                            "name":  "Dominate Beast",
                            "description":  "Make a beast fight alongside you. Every time the beast takes damage, it makes a Wisdom Saving Throw against your domination.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  4,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "Summons a dominated beast ally for 10 turns.",
                            "debuff":  "Target beast is Charmed and fights for you. When upcast at 5th level, duration extends to 10 turns with Concentration. At 6th level, duration extends to Long Rest with Concentration."
                        },
                        {
                            "name":  "Dominate Person",
                            "description":  "Make a humanoid fight alongside you. Every time the creature takes damage, it makes a Wisdom Saving Throw against your domination. Allies cannot be dominated.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  5,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "Summons a dominated humanoid ally for 10 turns.",
                            "debuff":  "Target humanoid is Charmed and fights for you. When upcast at 6th level, duration extends to Long Rest with Concentration."
                        },
                        {
                            "name":  "Hold Monster",
                            "description":  "Paralyse a creature. It can\u0027t move, act or react. Attacks from within 3m are always Critical Hits.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  5,
                            "upcastable":  true,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target creature is Paralyzed for 10 turns. Attacks from within 3m are automatic Critical Hits. Requires Concentration. When upcast, target an additional creature per spell slot level above 5th."
                        },
                        {
                            "name":  "Otto\u0027s Irresistible Dance",
                            "description":  "Cause a creature to start dancing, making it unable to take actions or move. Its attackers have Advantage on Attack Rolls.",
                            "school":  "Enchantment",
                            "type":  "spell",
                            "level":  6,
                            "upcastable":  false,
                            "damage":  "",
                            "buff":  "",
                            "debuff":  "Target is forced to dance for 10 turns, unable to take actions or move. Attackers have Advantage on Attack Rolls against it. Target has Disadvantage on Attack Rolls and Dexterity Saving Throws. Requires Concentration."
                        }
                    ],
    "Evocation":  [
                      {
                          "name":  "Dancing Lights",
                          "description":  "Create a wisp of light that illuminates a 12m / 40ft radius.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "",
                          "buff":  "Illuminates a 9m/30ft radius area for 10 turns. Requires Concentration.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Eldritch Blast",
                          "description":  "Conjure a beam of crackling energy. The spell creates more than one beam when you reach higher levels.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "1d10 Force per beam",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Fire Bolt",
                          "description":  "Hurl a mote of fire at an enemy as a ranged attack, dealing 1d10 Fire damage if it hits.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "1d10 Fire",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Light",
                          "description":  "Infuse an object with an aura of light. Only affects one target at a time.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "",
                          "buff":  "Target object emits bright light in a 9m / 30ft radius for 100 turns.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Ray of Frost",
                          "description":  "Call forth a frigid beam of blue light. Deals 1d8 Cold damage and reduces the target\u0027s Movement Speed by 3m / 10ft for 2 turns.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "1d8 Cold",
                          "buff":  "",
                          "debuff":  "Reduces the target\u0027s Movement Speed by 3m / 10ft for 1 turn."
                      },
                      {
                          "name":  "Sacred Flame",
                          "description":  "Engulf a target in a flame-like radiance that deals 1d8 Radiant damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "1d8 Radiant",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Shocking Grasp",
                          "description":  "Lightning springs from your hand. It deals 1d8 Lightning damage and prevents the target from taking Reactions. You have Advantage when using this spell on creatures wearing metal Armour.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  0,
                          "upcastable":  false,
                          "damage":  "1d8 Lightning",
                          "buff":  "",
                          "debuff":  "Target cannot take Reactions until the start of its next turn."
                      },
                      {
                          "name":  "Burning Hands",
                          "description":  "Fire shoots from your outstretched fingers. It ignites anything flammable and deals 3d6 Fire damage. On a successful save, targets still take half damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "3d6 Fire (Dex Save for half)",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Chromatic Orb",
                          "description":  "Hurl a sphere of energy that deals 3d8 Thunder damage and possibly creates a surface on impact. Alternatively, choose a different type of damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "3d8 Thunder (or 2d8 of another type)",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Cure Wounds",
                          "description":  "Heal a creature you can touch.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "",
                          "buff":  "Target regains 1d8+2 hit points. Has no effect on undead or constructs.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Divine Favour",
                          "description":  "Your prayer empowers you with divine radiance. Your weapons deal an additional 1d4 Radiant damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  false,
                          "damage":  "Weapon attacks deal an extra 1d4 Radiant damage",
                          "buff":  "Caster\u0027s weapon attacks deal an additional 1d4 Radiant damage for 3 turns. Requires Concentration.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Faerie Fire",
                          "description":  "Encase multiple targets in colorful light. The targets turn visible, and Attack Rolls against the target have Advantage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "",
                          "buff":  "All attacks against affected targets have Advantage for 10 turns. Requires Concentration.",
                          "debuff":  "Targets cannot benefit from Invisibility. Attack Rolls against them have Advantage."
                      },
                      {
                          "name":  "Guiding Bolt",
                          "description":  "Call forth a beam of light that deals 4d6 Radiant damage. The next Attack Roll against this target has Advantage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "4d6 Radiant",
                          "buff":  "",
                          "debuff":  "The next Attack Roll against the target has Advantage for 2 turns."
                      },
                      {
                          "name":  "Healing Word",
                          "description":  "Heal a creature you can see.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "",
                          "buff":  "Target regains 1d4 hit points. Has no effect on undead or constructs.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Hellish Rebuke",
                          "description":  "The next time you take damage, you use your Reaction to surround your attacker in hellish flames that deal 2d10 Fire damage. On a successful save, the target still takes half damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "2d10 Fire",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Magic Missile",
                          "description":  "Shoot 3 magical darts, each dealing 2d4+1 Force damage. They always hit their target.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "3 x (2d4+1) Force",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Searing Smite",
                          "description":  "Your weapon flares with white-hot intensity. It deals an extra 1d6 Fire damage and marks the target with Searing Smite. A target with Searing Smite takes 1d6 Fire damage every turn, until it succeeds on a Constitution Saving Throw.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "Initial: Weapon damage + 1d6 Fire. Subsequent: 1d6 Fire per turn.",
                          "buff":  "",
                          "debuff":  "Target is marked with Searing Smite, taking 1d6 Fire damage at the start of each of its turns unless it makes a Constitution Save."
                      },
                      {
                          "name":  "Thunderous Smite",
                          "description":  "Your weapon attacks deal an extra 2d6 Thunder damage and pushes your target 3m away and possibly knocks it Prone.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "Weapon damage + 2d6 Thunder",
                          "buff":  "",
                          "debuff":  "Target is pushed 3m away and may be knocked Prone (Str Save)."
                      },
                      {
                          "name":  "Thunderwave",
                          "description":  "Release a wave of thunderous force that deals 2d8 Thunder damage and pushes away all creatures and objects.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "2d8 Thunder (Con Save for half)",
                          "buff":  "",
                          "debuff":  "Targets are pushed away from the caster."
                      },
                      {
                          "name":  "Witch Bolt",
                          "description":  "Link yourself to a target with a bolt of lightning. Deals an additional 1d12 Lightning damage each turn by activating it.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "Initial: 1d12 Lightning. Subsequent: 1d12 Lightning per turn when activated.",
                          "buff":  "",
                          "debuff":  "Remains connected to target, dealing damage each turn. Ends if target moves out of range or breaks line of sight."
                      },
                      {
                          "name":  "Wrathful Smite",
                          "description":  "Your weapon attacks deal an extra 1d6 Psychic damage and possibly Frightens your target. They will be easier to hit and cannot move.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  1,
                          "upcastable":  true,
                          "damage":  "Weapon damage + 1d6 Psychic",
                          "buff":  "",
                          "debuff":  "Target may become Frightened (Wis Save), causing it to have Disadvantage on Ability Checks and Attack Rolls, and cannot move closer to the caster."
                      },
                      {
                          "name":  "Branding Smite",
                          "description":  "Your weapon gleams with astral radiance as you strike and possibly marks your target with light, preventing it from turning invisible. It deals an extra 2d6 Radiant damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "Weapon damage + 2d6 Radiant",
                          "buff":  "",
                          "debuff":  "Target is marked with light, preventing it from becoming Invisible."
                      },
                      {
                          "name":  "Darkness",
                          "description":  "Create a cloud of magical darkness to Heavily Obscure and Blind creatures within. Creatures cannot make ranged attacks into or out of the darkness.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  false,
                          "damage":  "",
                          "buff":  "Can be used to obscure your party from enemy ranged attacks. Warlocks with Devil\u0027s Sight can see through it.",
                          "debuff":  "Heavily Obscures and Blinds creatures inside the cloud for 10 turns. They cannot make ranged attacks into or out of it. Requires Concentration."
                      },
                      {
                          "name":  "Flame Blade",
                          "description":  "Conjure a flaming scimitar in your hand that deals 3d6 Fire damage. It sheds a bright light in a 3m / 10ft radius and a dim light in a 6m / 20ft radius.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "3d6 Fire (melee spell attack)",
                          "buff":  "Creates a flaming scimitar for melee attacks. Provides light. Requires Concentration.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Gust of Wind",
                          "description":  "Summon a strong wind that clears all clouds and pushes creatures back 5m, forcing them Off Balance.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  false,
                          "damage":  "",
                          "buff":  "Clears clouds and gas effects from an area.",
                          "debuff":  "Pushes creatures back 5m and inflicts Off Balance. Requires Concentration."
                      },
                      {
                          "name":  "Melf\u0027s Acid Arrow",
                          "description":  "Shoot a green arrow that covers the target and the ground with acid. Deals 4d4 Acid damage immediately and 2d4 Acid damage at the end of the target\u0027s turn.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "Initial: 4d4 Acid. Delayed: 2d4 Acid",
                          "buff":  "",
                          "debuff":  "Target takes additional Acid damage at the end of its next turn. On miss, still deals half initial damage."
                      },
                      {
                          "name":  "Moonbeam",
                          "description":  "Call down a beam of light that damages any creature that enters the beam or starts its turn in the light. You can use an action to move the beam 18m.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "2d10 Radiant (Con Save for half)",
                          "buff":  "",
                          "debuff":  "Damages creatures in the beam each turn. Can be moved each turn. Requires Concentration."
                      },
                      {
                          "name":  "Prayer of Healing",
                          "description":  "Heal all allies you can see.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "",
                          "buff":  "All visible allies regain 2d8+2 hit points. Has no effect on undead or constructs.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Scorching Ray",
                          "description":  "Hurl 3 rays of fire. Each ray deals 2d6 Fire damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "3 x 2d6 Fire",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Shatter",
                          "description":  "Generate a painfully intense ringing noise that deals 3d8 Thunder damage to all nearby creatures and objects. Creatures made of inorganic material such as stone have Disadvantage on their Saving Throw.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "3d8 Thunder (Con Save for half)",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Spiritual Weapon",
                          "description":  "Summon a floating, spectral weapon that attacks your enemies alongside you.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  2,
                          "upcastable":  true,
                          "damage":  "1d8+2 Force (varies by weapon type)",
                          "buff":  "Summons a weapon that attacks enemies as a Bonus Action. Does not require Concentration.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Blinding Smite",
                          "description":  "Evoke a heavenly flare when you hit with a weapon attack, dealing an extra 3d8 Radiant damage and possibly Blinding your target.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  true,
                          "damage":  "Weapon damage + 3d8 Radiant",
                          "buff":  "",
                          "debuff":  "Target may become Blinded (Con Save)."
                      },
                      {
                          "name":  "Crusader\u0027s Mantle",
                          "description":  "Radiate a holy power that emboldens nearby allies. Their weapon attacks deal an additional 1d4 Radiant damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  false,
                          "damage":  "Allies\u0027 weapon attacks deal an extra 1d4 Radiant damage",
                          "buff":  "Allies within 9m deal an additional 1d4 Radiant damage with weapon attacks. Requires Concentration.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Daylight",
                          "description":  "Enchant an item to shine like the sun or summon a sphere of sunlight that dispels all darkness around it.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  false,
                          "damage":  "",
                          "buff":  "Creates bright light in a 18m radius and dispels magical darkness.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Fireball",
                          "description":  "Shoot a bright flame from your fingers that explodes upon contact, torching everything in the vicinity with 8d6 Fire damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  true,
                          "damage":  "8d6 Fire (Dex Save for half)",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Lightning Bolt",
                          "description":  "Call forth a blast of lightning that deals 8d6 Lightning damage to all creatures in the line of the eruption.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  true,
                          "damage":  "8d6 Lightning (Dex Save for half)",
                          "buff":  "",
                          "debuff":  ""
                      },
                      {
                          "name":  "Mass Healing Word",
                          "description":  "Heal up to 6 allies you can see.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  true,
                          "damage":  "",
                          "buff":  "Up to 6 visible allies regain 1d4+4 hit points.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Warden of Vitality",
                          "description":  "While this aura lasts, you can cast Restore Vitality as a bonus action to heal yourself or nearby allies.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  3,
                          "upcastable":  false,
                          "damage":  "",
                          "buff":  "Allows the caster to heal themselves or allies within 3m for 1d6 each turn as a Bonus Action. Requires Concentration.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Fire Shield",
                          "description":  "Wreathe your body in flames that shed light in a 3m radius, provide Resistance to Fire or Cold damage, and retaliate against melee attacks.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  4,
                          "upcastable":  false,
                          "damage":  "2d8 Fire or Cold damage to melee attackers",
                          "buff":  "Caster gains Resistance to Fire or Cold damage and deals damage to melee attackers. Lasts 10 turns.",
                          "debuff":  ""
                      },
                      {
                          "name":  "Ice Storm",
                          "description":  "Impel a storm of hail and ice to crash from the sky, dealing 2d8 Bludgeoning and 4d6 Cold damage, covering the ground and striking all objects and creatures within range.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  4,
                          "upcastable":  true,
                          "damage":  "2d8 Bludgeoning + 4d6 Cold (Dex Save for half)",
                          "buff":  "",
                          "debuff":  "Creates an ice surface that may cause creatures to fall Prone."
                      },
                      {
                          "name":  "Otiluke\u0027s Resilient Sphere",
                          "description":  "Enclose a target in a sphere of shimmering force, reducing its movement speed by half, and blocking all incoming and outgoing damage.",
                          "school":  "Evocation",
                          "type":  "spell",
                          "level":  4,
                          "upcastable":  true,
                          "damage":  "",
                          "buff":  "Can protect an ally by enclosing them in an invulnerable sphere.",
                          "debuff":  "Traps an enemy in an invulnerable sphere, preventing them from dealing or receiving damage. Requires Concentration."
                      }
                  ],
    "Illusion":  [
                     {
                         "name":  "Minor Illusion",
                         "description":  "Create an illusory image that distracts nearby creatures, compelling them to investigate.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  0,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Creates a silent image to distract creatures. Can be cast while hidden.",
                         "debuff":  "Nearby creatures are compelled to investigate the illusion."
                     },
                     {
                         "name":  "Improved Minor Illusion",
                         "description":  "You can cast Minor Illusion as a bonus action. You can remain hidden while casting this spell. This spell can be cast while you are Silenced.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  0,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Creates a silent image as a bonus action. Can be cast while hidden or silenced.",
                         "debuff":  "Nearby creatures are compelled to investigate the illusion."
                     },
                     {
                         "name":  "Colour Spray",
                         "description":  "Blind creatures up to a combined 33 hit points.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  1,
                         "upcastable":  true,
                         "damage":  "",
                         "buff":  "",
                         "debuff":  "Creatures with total HP up to 33 are Blinded for 1 turn. When upcast, affects an additional 2d6 HP worth of creatures per spell slot level above 1st."
                     },
                     {
                         "name":  "Disguise Self",
                         "description":  "Magically change all aspects of your appearance. Lasts until Long Rest.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  1,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Caster can change appearance (race, gender, appearance) until Long Rest. Useful for dialogue and infiltration.",
                         "debuff":  ""
                     },
                     {
                         "name":  "Shapeshift",
                         "description":  "Magically change all aspects of your appearance.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  1,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Caster can change appearance.",
                         "debuff":  ""
                     },
                     {
                         "name":  "Blur",
                         "description":  "Your body becomes blurred. Attackers have Disadvantage on Attack Rolls against you. Doesn\u0027t affect creatures that don\u0027t rely on sight or that can see through illusions.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  2,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Caster gains Disadvantage on attack rolls against them for 10 turns.",
                         "debuff":  "",
                         "concentration":  true
                     },
                     {
                         "name":  "Invisibility",
                         "description":  "Touch a creature to turn it Invisible. Attacks against it have Disadvantage. It attacks with Advantage. The spell ends early if the creature attacks or casts a spell.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  2,
                         "upcastable":  true,
                         "damage":  "",
                         "buff":  "Target becomes Invisible for 10 turns. Attacks against it have Disadvantage; its attacks have Advantage.",
                         "debuff":  "",
                         "concentration":  true
                     },
                     {
                         "name":  "Mirror Image",
                         "description":  "Create 3 illusory duplicates of yourself that distract attackers. Each duplicate increases your Armour Class by 3. Whenever you successfully evade an attack, one of the duplicates disappears.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  2,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Caster gains +3 AC from duplicates for 10 turns. Each hit that would hit destroys one duplicate instead.",
                         "debuff":  ""
                     },
                     {
                         "name":  "Phantasmal Force",
                         "description":  "Flood a creature\u0027s mind with an illusion. Each turn, it takes 1d6 Psychic damage. The damage type changes to match the last type of damage the creature suffered.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  2,
                         "upcastable":  true,
                         "damage":  "1d6 Psychic per turn",
                         "buff":  "",
                         "debuff":  "Target takes ongoing psychic damage for 10 turns. Damage type adapts to other damage taken. Requires Concentration.",
                         "concentration":  true
                     },
                     {
                         "name":  "Shadow Blade",
                         "description":  "Weave a shadowy shortsword in your hand that deals 2d8 Psychic damage. When you attack a target in dim light or darkness, you make the Attack Roll with Advantage. Lasts until Long Rest or until concentration is broken.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  2,
                         "upcastable":  true,
                         "damage":  "2d8 Psychic (melee spell attack)",
                         "buff":  "Creates a shadowy shortsword that deals psychic damage and grants Advantage in dim light/darkness.",
                         "debuff":  "",
                         "concentration":  true
                     },
                     {
                         "name":  "Silence",
                         "description":  "Create a sound-proof sphere. All within are Silenced and Immune to Thunder damage. Using this spell might turn targets hostile.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  2,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Can protect allies from Thunder damage and sound-based effects.",
                         "debuff":  "Creates a sphere where creatures are Silenced (cannot cast spells with verbal components). Lasts 100 turns. Requires Concentration.",
                         "concentration":  true
                     },
                     {
                         "name":  "Fear",
                         "description":  "Project an image so frightening it makes targets drop everything and become Fearful. They have Disadvantage on Ability Checks and Attack Rolls and cannot move. If the target ends their turn where they can\u0027t see you, they can make another Saving Throw.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  3,
                         "upcastable":  true,
                         "damage":  "",
                         "buff":  "",
                         "debuff":  "Targets in a cone become Frightened for 3 turns, dropping weapons and unable to move. Requires Concentration. When upcast, affects additional creatures.",
                         "concentration":  true
                     },
                     {
                         "name":  "Hypnotic Pattern",
                         "description":  "Hypnotise creatures that can see the pattern. They cannot attack, move, or act. The effect ends if the creature takes damage, is Shoved, or receives Help.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  3,
                         "upcastable":  true,
                         "damage":  "",
                         "buff":  "",
                         "debuff":  "Creatures in the area become Hypnotised for 2 turns, unable to act. Requires Concentration. When upcast, affects additional creatures.",
                         "concentration":  true
                     },
                     {
                         "name":  "Greater Invisibility",
                         "description":  "Turn a creature Invisible. Attacks against it have Disadvantage. It attacks with Advantage. Unlike regular Invisibility, this spell allows the target to attack or cast spells without breaking invisibility, though they must make increasingly difficult Stealth checks.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  4,
                         "upcastable":  false,
                         "damage":  "",
                         "buff":  "Target becomes Invisible for 10 turns. Can attack and cast spells while remaining invisible.",
                         "debuff":  "",
                         "concentration":  true
                     },
                     {
                         "name":  "Phantasmal Killer",
                         "description":  "Haunt a creature with illusions of its greatest fears. It takes 4d10 Psychic damage per turn, cannot move, and has Disadvantage on Ability Checks and Attack Rolls.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  4,
                         "upcastable":  true,
                         "damage":  "4d10 Psychic per turn",
                         "buff":  "",
                         "debuff":  "Target is Frightened, cannot move, takes heavy psychic damage each turn. Requires Concentration. When upcast, deals an additional 1d10 Psychic damage per spell slot level above 4th.",
                         "concentration":  true
                     },
                     {
                         "name":  "Seeming",
                         "description":  "Disguise up to 4 members of your adventuring party. Unlike Disguise Self, this can target multiple creatures at once.",
                         "school":  "Illusion",
                         "type":  "spell",
                         "level":  5,
                         "upcastable":  true,
                         "damage":  "",
                         "buff":  "Up to 4 allies gain disguises (appearance changes) for 10 turns. Requires Concentration. When upcast, affects additional creatures.",
                         "debuff":  "",
                         "concentration":  true
                     }
                 ],
    "Necromancy":  [
                       {
                           "name":  "Bone Chill",
                           "description":  "Assail a creature with the chill of the grave. It takes 1d8 Necrotic damage and cannot regain Hit Points. Undead creatures also get Disadvantage on Attack Rolls.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  0,
                           "upcastable":  false,
                           "damage":  "1d8 Necrotic",
                           "buff":  "",
                           "debuff":  "Target cannot regain Hit Points until the start of your next turn. If the target is Undead, it also has Disadvantage on Attack Rolls."
                       },
                       {
                           "name":  "Toll the Dead",
                           "description":  "Ring the bell of impending doom. If the target is at full health, you deal 1d12 Necrotic damage instead of 1d8.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  0,
                           "upcastable":  false,
                           "damage":  "1d8 Necrotic (or 1d12 if target is at full health)",
                           "buff":  "",
                           "debuff":  ""
                       },
                       {
                           "name":  "False Life",
                           "description":  "Bolster yourself with a necromantic facsimile of life to gain 7 temporary hit points.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "Caster gains 7 temporary hit points until Long Rest. When upcast, gain an additional 5 temporary hit points per spell slot level above 1st.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Inflict Wounds",
                           "description":  "Putrefy a creature with the necrotic energy filling your hands, dealing 3d10 Necrotic damage.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  true,
                           "damage":  "3d10 Necrotic",
                           "buff":  "",
                           "debuff":  ""
                       },
                       {
                           "name":  "Ray of Sickness",
                           "description":  "Call forth a ray of sickening energy that deals 2d8 Poison damage and possibly Poisons the target.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  1,
                           "upcastable":  true,
                           "damage":  "2d8 Poison",
                           "buff":  "",
                           "debuff":  "Target may become Poisoned for 2 turns, suffering Disadvantage on Attack Rolls and Ability Checks."
                       },
                       {
                           "name":  "Blindness",
                           "description":  "Magically blind an enemy creature, limiting its sight range. Attack Rolls against it have Advantage and the foe attacks with Disadvantage.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  true,
                           "damage":  "",
                           "buff":  "",
                           "debuff":  "Target is Blinded for 10 turns. Attack Rolls against it have Advantage, and its attacks have Disadvantage."
                       },
                       {
                           "name":  "Ray of Enfeeblement",
                           "description":  "A beam of enervating energy springs from your fingers to weaken a foe. The target deals half damage with Weapon Attacks using Strength.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  2,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "",
                           "debuff":  "Target deals half damage with Strength-based weapon attacks for 10 turns. Requires Concentration."
                       },
                       {
                           "name":  "Animate Dead",
                           "description":  "Create an undead servant from a corpse. The target must be a Medium or Small corpse.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  true,
                           "damage":  "Summon attacks vary (typically 1d6+3 + 1d10 Necrotic)",
                           "buff":  "Summons a zombie or skeleton minion that fights for you. When upcast at Level 4, creates 3 minions. At Level 5, creates a Ghoul. At Level 6, creates 3 Ghouls or Flying Ghouls.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Bestow Curse",
                           "description":  "Curse a creature with your touch. The curse either bestows Disadvantage on checks and Saving Throws or attacks, lets you deal additional damage to the target, or robs it of its actions.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  true,
                           "damage":  "If using damage option: +1d8 Necrotic per attack",
                           "buff":  "",
                           "debuff":  "Choose one curse effect for 10 turns: Disadvantage on Ability Checks and Saving Throws; Disadvantage on Attack Rolls; target must make WIS save each turn or lose its action; or your attacks deal an extra 1d8 Necrotic damage. Requires Concentration. When upcast to Level 4 or 5, duration extends and Concentration not required."
                       },
                       {
                           "name":  "Feign Death",
                           "description":  "Put an ally in a protective, magical coma deep enough to imitate death. The ally becomes Resistant to all damage except psychic damage, and disease and poison no longer have any effect.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Target ally becomes immune to poison and disease, gains Resistance to all damage except Psychic, and appears dead for 10 turns.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Revivify",
                           "description":  "Revive a companion. They return to life with 1 hit point. Can only target a companion character who is dead.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Revives a dead companion with 1 HP.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Speak with Dead",
                           "description":  "Grant a semblance of life to a humanoid corpse, allowing it to answer up to 5 questions. Skeletons and creatures killed with Acid, Fire, Lightning, Necrotic, or Radiant damage no longer have a mouth and can\u0027t be made to talk using this spell.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "Allows caster to question a corpse for information.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Vampiric Touch",
                           "description":  "Touch an enemy to siphon their life force. You regain half as many hit points as the damage they take. For 10 turns, you can use Vampiric Touch again without expending an additional spell slot.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  3,
                           "upcastable":  true,
                           "damage":  "3d6 Necrotic",
                           "buff":  "Caster regains HP equal to half the damage dealt.",
                           "debuff":  "",
                           "concentration":  true
                       },
                       {
                           "name":  "Blight",
                           "description":  "Plants are more susceptible to this spell: they roll with Disadvantage, and still take half of all the damage if they succeed the roll. Deals 8d8 Necrotic damage.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  4,
                           "upcastable":  true,
                           "damage":  "8d8 Necrotic (CON Save for half)",
                           "buff":  "",
                           "debuff":  "Plants have Disadvantage on their Saving Throw against this spell."
                       },
                       {
                           "name":  "Contagion",
                           "description":  "Poison a target and possibly afflict them with a disease of your choice. The disease effects vary based on which ability score is targeted.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  5,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "",
                           "debuff":  "Target becomes diseased for 10 turns. Options include: Blinding Sickness (Blinded, WIS Disadvantage); Filth Fever (Exhausted, STR Disadvantage); Flesh Rot (Vulnerability to all damage, CHA Disadvantage); Mindfire (Confused, INT Disadvantage); Red Ache (Reduced movement, DEX Disadvantage); Shakes (Stunned when hit, CON Disadvantage)."
                       },
                       {
                           "name":  "Circle of Death",
                           "description":  "Sculpt a massive sphere of entropic energy around a creature. Devastate the target and all surrounding creatures with 8d6 Necrotic damage.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  6,
                           "upcastable":  true,
                           "damage":  "8d6 Necrotic (CON Save for half)",
                           "buff":  "",
                           "debuff":  ""
                       },
                       {
                           "name":  "Create Undead",
                           "description":  "Raise a corpse as a heinous mummy that fights by your side until Long Rest. The target must be a Medium or Small corpse.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  6,
                           "upcastable":  false,
                           "damage":  "Mummy attacks vary",
                           "buff":  "Summons a powerful mummy minion that fights for you until Long Rest.",
                           "debuff":  ""
                       },
                       {
                           "name":  "Eyebite",
                           "description":  "Your eyes become black corridors walled in teeth, your gaze capable of inflicting dread, sickness, or putting creatures to sleep. While Concentrating, you may cast Eyebite without expending a spell slot.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  6,
                           "upcastable":  false,
                           "damage":  "",
                           "buff":  "",
                           "debuff":  "Choose one effect per turn for 100 turns: Asleep (target falls unconscious); Panicked (target is Frightened); Sickened (target has Disadvantage on Attack Rolls and Ability Checks). Requires Concentration."
                       },
                       {
                           "name":  "Harm",
                           "description":  "Reduce a target\u0027s maximum hit points by 14d6, but never below 1. On a successful save, the target still takes half damage.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  6,
                           "upcastable":  false,
                           "damage":  "14d6 Necrotic (CON Save for half)",
                           "buff":  "",
                           "debuff":  "Target\u0027s maximum HP is reduced by the damage taken until Long Rest (cannot go below 1 HP)."
                       },
                       {
                           "name":  "Danse Macabre",
                           "description":  "Summon 4 ghouls that fight by your side. Obtained by deciphering the Necromancy of Thay.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  5,
                           "upcastable":  false,
                           "damage":  "Ghoul attacks: 2d4+1 Slashing + possible Paralysis",
                           "buff":  "Summons 4 ghoul minions that can Paralyze enemies.",
                           "debuff":  "Ghoul attacks may Paralyze targets (CON Save)."
                       },
                       {
                           "name":  "Dethrone",
                           "description":  "Shred a foe\u0027s very essence by pulling on strands of the Weave, dealing 10d6+20 Necrotic damage.",
                           "school":  "Necromancy",
                           "type":  "spell",
                           "level":  5,
                           "upcastable":  false,
                           "damage":  "10d6+20 Necrotic (CON Save for half)",
                           "buff":  "",
                           "debuff":  ""
                       }
                   ],
    "Transmutation":  [
                          {
                              "name":  "Barkskin",
                              "description":  "Touch a willing creature to toughen its skin and increase its Armour Class up to 16.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target\u0027s AC becomes 16 (if lower) for 10 turns. Requires Concentration.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Blink",
                              "description":  "At the end of your turn, roll a d20. On 11 or higher, you vanish into the Ethereal Plane. While there, you can\u0027t be harmed or seen. You can choose to teleport your return location up to 6m.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Caster has 50% chance to become ethereal each turn, avoiding damage for 10 turns.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Celestial Haste",
                              "description":  "Gain Hastened without suffering Lethargic after the effect ends.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target gains +2 AC, Advantage on Dex Saves, doubled speed, and an extra action each turn for 5 turns. No lethargic penalty when spell ends. Requires Concentration.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Create or Destroy Water",
                              "description":  "Choose to call forth rain or destroy a water-based surface. Call forth rain: extinguishes exposed flames and forms a water surface. Destroy water: causes water-based surfaces (water, steam, ice, blood, poison) to vanish.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  1,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Can create water surfaces for elemental interactions or remove hazardous surfaces.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Darkvision",
                              "description":  "Grant a creature the ability to see in the dark out to a range of 12m.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target gains darkvision (12m range) until Long Rest.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Disintegrate",
                              "description":  "Shoot a thin green ray from your finger. If the 50-100 Force damage reduces the target to 0 hit points, it disintegrates into a crumbly ash.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  6,
                              "upcastable":  true,
                              "damage":  "10d6+40 Force (Dex Save negates)",
                              "buff":  "",
                              "debuff":  "Target that fails save takes massive damage. If reduced to 0 HP, target is disintegrated (cannot be revived except by True Resurrection or Wish). When upcast, deals an additional 3d6 Force damage per spell slot level above 6th."
                          },
                          {
                              "name":  "Elemental Weapon",
                              "description":  "Imbue a weapon with elemental power. It receives a +1 bonus to Attack Rolls, and deals an additional 1d4 damage of your choice.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  true,
                              "damage":  "Weapon deals +1d4 elemental damage (Acid, Cold, Fire, Lightning, or Thunder)",
                              "buff":  "Target weapon gains +1 Attack and +1d4 chosen elemental damage for 10 turns. Requires Concentration. When upcast, bonus increases to +2 at Level 4, +3 at Level 5.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Enhance Ability",
                              "description":  "Bestow a magical enhancement upon an ally. They gain Advantage on Ability Checks with a chosen Ability.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  true,
                              "damage":  "",
                              "buff":  "Target gains Advantage on Ability Checks for one chosen ability score for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 2nd.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Enhance Leap",
                              "description":  "Triple a creature\u0027s jumping distance.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  1,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target\u0027s jump distance is tripled for 10 turns. Can be cast as a Ritual outside combat.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Enlarge/Reduce",
                              "description":  "Make a creature larger or smaller. This affects their weapon damage and Strength Checks and Saving Throws.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  false,
                              "damage":  "Enlarge: Weapon attacks deal an extra 1d4 damage",
                              "buff":  "Enlarge: Target becomes larger, gains Advantage on Strength Checks and Saves, and deals +1d4 weapon damage for 10 turns.",
                              "debuff":  "Reduce: Target becomes smaller, has Disadvantage on Strength Checks and Saves, and deals 1d4 less weapon damage for 10 turns. Requires Concentration."
                          },
                          {
                              "name":  "Etherealness",
                              "description":  "The caster is projected into the Ethereal Plane. While there, you can\u0027t be harmed or seen in this world.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  7,
                              "upcastable":  true,
                              "damage":  "",
                              "buff":  "Caster becomes ethereal, unable to be harmed or interact with the material world. When upcast, can target additional creatures per spell slot level above 7th.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Expeditious Retreat",
                              "description":  "Gain Dash immediately and as a bonus action on each of your turns until this spell ends.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  1,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Caster can Dash as a Bonus Action for 10 turns. Requires Concentration.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Feather Fall",
                              "description":  "Slow the rate of descent of allied creatures. They become Immune to Falling damage.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  1,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Caster and nearby allies gain immunity to falling damage for 10 turns. Can be cast as a Ritual outside combat.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Flesh to Stone",
                              "description":  "Atrophy a foe, Restraining them until they temporarily turn to stone. The target will Petrify if it does not succeed its Saving Throw within 3 turns.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  6,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "",
                              "debuff":  "Target is Restrained for 3 turns, then becomes Petrified. Requires Concentration."
                          },
                          {
                              "name":  "Fly",
                              "description":  "Bestow the ability to Fly upon yourself or an ally.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  true,
                              "damage":  "",
                              "buff":  "Target gains flight (18m movement speed) for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 3rd.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Gaseous Form",
                              "description":  "Transform yourself or an ally into a cloud of mist. The target becomes Resistant to all damage, gains Advantage on Constitution, Dexterity, and Strength Saving Throws, and becomes tiny in size. Can\u0027t fall, fits through small openings.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target transforms into mist, gaining damage Resistance, Advantage on physical Saves, and ability to pass through small gaps for 10 turns. Requires Concentration.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Goodberry",
                              "description":  "Conjure four magical berries for yourself or a companion. Creatures who eat a berry regain 1d4 hit points. The berries appear in the targeted creature\u0027s inventory and disappear after a Long Rest.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  1,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Creates 4 berries that each heal 1d4 HP when consumed.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Haste",
                              "description":  "Target yourself or an ally to become Hastened. The creature has a +2 bonus to Armour Class, Advantage on Dexterity Saving Throws, its Movement Speed is doubled, and can take one additional Action per turn. When the spell ends, the target cannot move or act for 1 turn.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target gains +2 AC, Advantage on Dex Saves, doubled speed, and an extra action each turn for 3 turns. Requires Concentration.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Heat Metal",
                              "description":  "Cause a metal weapon or armour to glow red-hot. If the creature is still touching the metal, you can use a bonus action on subsequent turns to deal another 2d8 Fire damage and force the creature to let go or receive Disadvantage.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  true,
                              "damage":  "2d8 Fire (initial and each subsequent turn)",
                              "buff":  "",
                              "debuff":  "Target touching metal suffers Disadvantage on Attack Rolls and Ability Checks. Can be forced to drop metal objects. Requires Concentration. When upcast, deals an additional 1d8 Fire damage per spell slot level above 2nd."
                          },
                          {
                              "name":  "Lightning Arrow",
                              "description":  "After the arrow hits, smaller bolts snake out from the target toward nearby creatures.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  true,
                              "damage":  "Weapon damage + 2d8 Lightning (primary), 2d8 Lightning (secondary targets)",
                              "buff":  "",
                              "debuff":  "When upcast, damage increases by 1d8 per spell slot level above 3rd."
                          },
                          {
                              "name":  "Longstrider",
                              "description":  "Touch a creature to increase its Movement Speed by 3m.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  1,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Target\u0027s movement speed increases by 3m until Long Rest. Can be cast as a Ritual outside combat.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Magic Weapon",
                              "description":  "Infuse a weapon with arcane energy. The weapon becomes magical, receiving a +1 bonus to Attack and Damage Rolls.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  true,
                              "damage":  "Weapon deals +1 damage",
                              "buff":  "Target weapon becomes magical with +1 to Attack and Damage Rolls for 10 turns. Requires Concentration. When upcast, bonus increases to +2 at Level 3, +3 at Level 4.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Plant Growth",
                              "description":  "Make weeds burst from the ground and smother the area. Creatures moving through the weeds have their Movement Speed quartered.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "",
                              "debuff":  "Creates an area where creatures\u0027 speed is reduced to 1/4 for 10 turns. Does not require Concentration."
                          },
                          {
                              "name":  "Polymorph",
                              "description":  "Transform a creature into a harmless sheep. If the sheep\u0027s hit points drop to 0, the target reverts to its original form with its original hit points.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  4,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Can be used on allies to temporarily remove them from danger or provide utility.",
                              "debuff":  "Target transforms into a sheep for 5 turns, unable to attack or cast spells. Requires Concentration."
                          },
                          {
                              "name":  "Shillelagh",
                              "description":  "Your staff or club becomes magical: it deals 1d8+2 Bludgeoning damage, and uses your Spellcasting Ability for Attack Rolls.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  0,
                              "upcastable":  false,
                              "damage":  "1d8+2 Bludgeoning",
                              "buff":  "Weapon becomes magical and uses spellcasting ability for attack rolls for 10 turns. Does not require Concentration.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Slow",
                              "description":  "Alter time around up to 6 enemies to Slow them. Slowed creatures have reduced speed, can only take one action per turn, and have lower AC and Dexterity Saves.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  3,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "",
                              "debuff":  "Up to 6 targets are Slowed for 10 turns: speed halved, -2 AC, Disadvantage on Dex Saves, can only take one action. Requires Concentration."
                          },
                          {
                              "name":  "Spike Growth",
                              "description":  "Shape a piece of ground into hard spikes. A creature walking on the spikes takes 2d4 Piercing damage for every 1.5m it moves. The spikes are difficult terrain, halving a creature\u0027s Movement Speed.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  2,
                              "upcastable":  false,
                              "damage":  "2d4 Piercing per 1.5m moved",
                              "buff":  "",
                              "debuff":  "Creates an area of difficult terrain that damages creatures moving through it. Requires Concentration."
                          },
                          {
                              "name":  "Telekinesis",
                              "description":  "Throw a creature or object up to 18m with a thought. Once per turn, you can use Telekinesis again without expending a spell slot. Heavier items deal more damage.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  5,
                              "upcastable":  false,
                              "damage":  "Varies by object weight (typically 2d4 to 8d6)",
                              "buff":  "Allows manipulation and throwing of objects and creatures for 10 turns.",
                              "debuff":  "Target creature can be moved or thrown. Requires Concentration."
                          },
                          {
                              "name":  "Thaumaturgy",
                              "description":  "Manifest a sign of supernatural power that grants you Advantage on Intimidation and Performance Skill Checks.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  0,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Caster gains Advantage on Intimidation and Performance checks for 10 turns.",
                              "debuff":  ""
                          },
                          {
                              "name":  "Thorn Whip",
                              "description":  "Strike at a target with a thorny, vine-like whip. It deals 1d6 Piercing damage and pulls the target 3m closer to you if it is Large or Smaller in size.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  0,
                              "upcastable":  false,
                              "damage":  "1d6 Piercing",
                              "buff":  "",
                              "debuff":  "Target is pulled 3m closer to the caster."
                          },
                          {
                              "name":  "Wind Walk",
                              "description":  "Transform yourself and all nearby party members into tiny clouds of mist to avoid attacks. You become Resistant to non-magical damage, gain Advantage on Constitution, Dexterity and Strength Saving Throws, and become tiny in size.",
                              "school":  "Transmutation",
                              "type":  "spell",
                              "level":  6,
                              "upcastable":  false,
                              "damage":  "",
                              "buff":  "Caster and nearby allies transform into mist, gaining damage Resistance and Advantage on physical Saves until Long Rest.",
                              "debuff":  ""
                          }
                      ]
}
