[
  {
    "name": "Shillelagh",
    "description": "Your staff or club becomes magical: it deals 1d8+2 Bludgeoning damage, and uses your Spellcasting Ability for Attack Rolls.",
    "school": "Transmutation",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "1d8+2 Bludgeoning",
    "buff": "Weapon becomes magical and uses spellcasting ability for attack rolls for 10 turns. Does not require Concentration.",
    "debuff": ""
  },
  {
    "name": "Thaumaturgy",
    "description": "Manifest a sign of supernatural power that grants you Advantage on Intimidation and Performance Skill Checks.",
    "school": "Transmutation",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains Advantage on Intimidation and Performance checks for 10 turns.",
    "debuff": ""
  },
  {
    "name": "Thorn Whip",
    "description": "Strike at a target with a thorny, vine-like whip. It deals 1d6 Piercing damage and pulls the target 3m closer to you if it is Large or Smaller in size.",
    "school": "Transmutation",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "1d6 Piercing",
    "buff": "",
    "debuff": "Target is pulled 3m closer to the caster."
  },
  {
    "name": "Create or Destroy Water",
    "description": "Choose to call forth rain or destroy a water-based surface. Call forth rain: extinguishes exposed flames and forms a water surface. Destroy water: causes water-based surfaces (water, steam, ice, blood, poison) to vanish.",
    "school": "Transmutation",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Can create water surfaces for elemental interactions or remove hazardous surfaces.",
    "debuff": ""
  },
  {
    "name": "Enhance Leap",
    "description": "Triple a creature's jumping distance.",
    "school": "Transmutation",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target's jump distance is tripled for 10 turns. Can be cast as a Ritual outside combat.",
    "debuff": ""
  },
  {
    "name": "Expeditious Retreat",
    "description": "Gain Dash immediately and as a bonus action on each of your turns until this spell ends.",
    "school": "Transmutation",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Caster can Dash as a Bonus Action for 10 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Feather Fall",
    "description": "Slow the rate of descent of allied creatures. They become Immune to Falling damage.",
    "school": "Transmutation",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Caster and nearby allies gain immunity to falling damage for 10 turns. Can be cast as a Ritual outside combat.",
    "debuff": ""
  },
  {
    "name": "Goodberry",
    "description": "Conjure four magical berries for yourself or a companion. Creatures who eat a berry regain 1d4 hit points. The berries appear in the targeted creature's inventory and disappear after a Long Rest.",
    "school": "Transmutation",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Creates 4 berries that each heal 1d4 HP when consumed.",
    "debuff": ""
  },
  {
    "name": "Longstrider",
    "description": "Touch a creature to increase its Movement Speed by 3m.",
    "school": "Transmutation",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Target's movement speed increases by 3m until Long Rest. Can be cast as a Ritual outside combat.",
    "debuff": ""
  },
  {
    "name": "Barkskin",
    "description": "Touch a willing creature to toughen its skin and increase its Armour Class up to 16.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Target's AC becomes 16 (if lower) for 10 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Darkvision",
    "description": "Grant a creature the ability to see in the dark out to a range of 12m.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains darkvision (12m range) until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Enhance Ability",
    "description": "Bestow a magical enhancement upon an ally. They gain Advantage on Ability Checks with a chosen Ability.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "",
    "buff": "Target gains Advantage on Ability Checks for one chosen ability score for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 2nd.",
    "debuff": ""
  },
  {
    "name": "Enlarge/Reduce",
    "description": "Make a creature larger or smaller. This affects their weapon damage and Strength Checks and Saving Throws.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "Enlarge: Weapon attacks deal an extra 1d4 damage",
    "buff": "Enlarge: Target becomes larger, gains Advantage on Strength Checks and Saves, and deals +1d4 weapon damage for 10 turns.",
    "debuff": "Reduce: Target becomes smaller, has Disadvantage on Strength Checks and Saves, and deals 1d4 less weapon damage for 10 turns. Requires Concentration."
  },
  {
    "name": "Heat Metal",
    "description": "Cause a metal weapon or armour to glow red-hot. If the creature is still touching the metal, you can use a bonus action on subsequent turns to deal another 2d8 Fire damage and force the creature to let go or receive Disadvantage.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "2d8 Fire (initial and each subsequent turn)",
    "buff": "",
    "debuff": "Target touching metal suffers Disadvantage on Attack Rolls and Ability Checks. Can be forced to drop metal objects. Requires Concentration. When upcast, deals an additional 1d8 Fire damage per spell slot level above 2nd."
  },
  {
    "name": "Magic Weapon",
    "description": "Infuse a weapon with arcane energy. The weapon becomes magical, receiving a +1 bonus to Attack and Damage Rolls.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "Weapon deals +1 damage",
    "buff": "Target weapon becomes magical with +1 to Attack and Damage Rolls for 10 turns. Requires Concentration. When upcast, bonus increases to +2 at Level 3, +3 at Level 4.",
    "debuff": ""
  },
  {
    "name": "Spike Growth",
    "description": "Shape a piece of ground into hard spikes. A creature walking on the spikes takes 2d4 Piercing damage for every 1.5m it moves. The spikes are difficult terrain, halving a creature's Movement Speed.",
    "school": "Transmutation",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "2d4 Piercing per 1.5m moved",
    "buff": "",
    "debuff": "Creates an area of difficult terrain that damages creatures moving through it. Requires Concentration."
  },
  {
    "name": "Blink",
    "description": "At the end of your turn, roll a d20. On 11 or higher, you vanish into the Ethereal Plane. While there, you can't be harmed or seen. You can choose to teleport your return location up to 6m.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Caster has 50% chance to become ethereal each turn, avoiding damage for 10 turns.",
    "debuff": ""
  },
  {
    "name": "Elemental Weapon",
    "description": "Imbue a weapon with elemental power. It receives a +1 bonus to Attack Rolls, and deals an additional 1d4 damage of your choice.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "Weapon deals +1d4 elemental damage (Acid, Cold, Fire, Lightning, or Thunder)",
    "buff": "Target weapon gains +1 Attack and +1d4 chosen elemental damage for 10 turns. Requires Concentration. When upcast, bonus increases to +2 at Level 4, +3 at Level 5.",
    "debuff": ""
  },
  {
    "name": "Fly",
    "description": "Bestow the ability to Fly upon yourself or an ally.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "",
    "buff": "Target gains flight (18m movement speed) for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 3rd.",
    "debuff": ""
  },
  {
    "name": "Gaseous Form",
    "description": "Transform yourself or an ally into a cloud of mist. The target becomes Resistant to all damage, gains Advantage on Constitution, Dexterity, and Strength Saving Throws, and becomes tiny in size. Can't fall, fits through small openings.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Target transforms into mist, gaining damage Resistance, Advantage on physical Saves, and ability to pass through small gaps for 10 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Haste",
    "description": "Target yourself or an ally to become Hastened. The creature has a +2 bonus to Armour Class, Advantage on Dexterity Saving Throws, its Movement Speed is doubled, and can take one additional Action per turn. When the spell ends, the target cannot move or act for 1 turn.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains +2 AC, Advantage on Dex Saves, doubled speed, and an extra action each turn for 3 turns. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Lightning Arrow",
    "description": "After the arrow hits, smaller bolts snake out from the target toward nearby creatures.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "Weapon damage + 2d8 Lightning (primary), 2d8 Lightning (secondary targets)",
    "buff": "",
    "debuff": "When upcast, damage increases by 1d8 per spell slot level above 3rd."
  },
  {
    "name": "Plant Growth",
    "description": "Make weeds burst from the ground and smother the area. Creatures moving through the weeds have their Movement Speed quartered.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Creates an area where creatures' speed is reduced to 1/4 for 10 turns. Does not require Concentration."
  },
  {
    "name": "Slow",
    "description": "Alter time around up to 6 enemies to Slow them. Slowed creatures have reduced speed, can only take one action per turn, and have lower AC and Dexterity Saves.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Up to 6 targets are Slowed for 10 turns: speed halved, -2 AC, Disadvantage on Dex Saves, can only take one action. Requires Concentration."
  },
  {
    "name": "Polymorph",
    "description": "Transform a creature into a harmless sheep. If the sheep's hit points drop to 0, the target reverts to its original form with its original hit points.",
    "school": "Transmutation",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Can be used on allies to temporarily remove them from danger or provide utility.",
    "debuff": "Target transforms into a sheep for 5 turns, unable to attack or cast spells. Requires Concentration."
  },
  {
    "name": "Telekinesis",
    "description": "Throw a creature or object up to 18m with a thought. Once per turn, you can use Telekinesis again without expending a spell slot. Heavier items deal more damage.",
    "school": "Transmutation",
    "type": "spell",
    "level": 5,
    "upcastable": false,
    "damage": "Varies by object weight (typically 2d4 to 8d6)",
    "buff": "Allows manipulation and throwing of objects and creatures for 10 turns.",
    "debuff": "Target creature can be moved or thrown. Requires Concentration."
  },
  {
    "name": "Disintegrate",
    "description": "Shoot a thin green ray from your finger. If the 50-100 Force damage reduces the target to 0 hit points, it disintegrates into a crumbly ash.",
    "school": "Transmutation",
    "type": "spell",
    "level": 6,
    "upcastable": true,
    "damage": "10d6+40 Force (Dex Save negates)",
    "buff": "",
    "debuff": "Target that fails save takes massive damage. If reduced to 0 HP, target is disintegrated (cannot be revived except by True Resurrection or Wish). When upcast, deals an additional 3d6 Force damage per spell slot level above 6th."
  },
  {
    "name": "Flesh to Stone",
    "description": "Atrophy a foe, Restraining them until they temporarily turn to stone. The target will Petrify if it does not succeed its Saving Throw within 3 turns.",
    "school": "Transmutation",
    "type": "spell",
    "level": 6,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Target is Restrained for 3 turns, then becomes Petrified. Requires Concentration."
  },
  {
    "name": "Wind Walk",
    "description": "Transform yourself and all nearby party members into tiny clouds of mist to avoid attacks. You become Resistant to non-magical damage, gain Advantage on Constitution, Dexterity and Strength Saving Throws, and become tiny in size.",
    "school": "Transmutation",
    "type": "spell",
    "level": 6,
    "upcastable": false,
    "damage": "",
    "buff": "Caster and nearby allies transform into mist, gaining damage Resistance and Advantage on physical Saves until Long Rest.",
    "debuff": ""
  },
  {
    "name": "Etherealness",
    "description": "The caster is projected into the Ethereal Plane. While there, you can't be harmed or seen in this world.",
    "school": "Transmutation",
    "type": "spell",
    "level": 7,
    "upcastable": true,
    "damage": "",
    "buff": "Caster becomes ethereal, unable to be harmed or interact with the material world. When upcast, can target additional creatures per spell slot level above 7th.",
    "debuff": ""
  },
  {
    "name": "Celestial Haste",
    "description": "Gain Hastened without suffering Lethargic after the effect ends.",
    "school": "Transmutation",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "Target gains +2 AC, Advantage on Dex Saves, doubled speed, and an extra action each turn for 5 turns. No lethargic penalty when spell ends. Requires Concentration.",
    "debuff": ""
  }
]