[
  {
    "name": "Friends",
    "description": "Gain Advantage on Charisma Checks against a non-hostile creature. In higher difficulty modes, the target might accuse you of enchanting them.",
    "school": "Enchantment",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains Advantage on Charisma checks against the target for 10 turns.",
    "debuff": ""
  },
  {
    "name": "Vicious Mockery",
    "description": "Insult a creature: it has Disadvantage on its next Attack Roll.",
    "school": "Enchantment",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "1d4 Psychic",
    "buff": "",
    "debuff": "Target has Disadvantage on its next Attack Roll. Lasts 1 turn."
  },
  {
    "name": "Animal Friendship",
    "description": "Convince a beast not to attack you.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Target beast cannot attack you for 10 turns."
  },
  {
    "name": "Bane",
    "description": "Up to 3 creatures receive a -1d4 penalty to Attack Rolls and Saving Throws.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Up to 3 targets suffer -1d4 penalty to Attack Rolls and Saving Throws for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 1st."
  },
  {
    "name": "Bless",
    "description": "Bless up to 3 creatures. They gain a +1d4 bonus to Attack Rolls and Saving Throws.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "Up to 3 allies gain +1d4 bonus to Attack Rolls and Saving Throws for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 1st.",
    "debuff": ""
  },
  {
    "name": "Challenge to Duel",
    "description": "Challenge an enemy to attack only you, inflicting Bleeding on the target.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Target is forced to attack only the caster for 3 turns and suffers Bleeding."
  },
  {
    "name": "Charm Person",
    "description": "Charm a humanoid to prevent it from attacking you. You gain Advantage on Charisma Checks in dialogue and prevent it from attacking.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "Caster gains Advantage on Charisma checks against the target in dialogue.",
    "debuff": "Target humanoid is Charmed and cannot attack you for 10 turns. When upcast, target an additional humanoid per spell slot level above 1st."
  },
  {
    "name": "Command",
    "description": "Command a creature to flee, move closer, freeze, drop to the ground or drop their weapon.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Target must obey a single-word command for 1 turn. When upcast, target an additional creature per spell slot level above 1st."
  },
  {
    "name": "Compelled Duel",
    "description": "Compel an enemy to attack only you. It cannot attack other creatures.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Target is forced to attack only the caster for 3 turns."
  },
  {
    "name": "Dissonant Whispers",
    "description": "Whisper a discordant melody to a creature and Frighten it.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "3d6 Psychic",
    "buff": "",
    "debuff": "Target is Frightened for 2 turns. When upcast, deal an additional 1d6 Psychic damage per spell slot level above 1st."
  },
  {
    "name": "Exhort the Risen",
    "description": "Subjugate the undead with your commands.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Commands an undead creature to obey you."
  },
  {
    "name": "Heroism",
    "description": "Make yourself or a target immune to Frightened and gain 5 temporary hit points each turn.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "Target becomes immune to Frightened and gains 5 temporary HP each turn for 10 turns. Requires Concentration. When upcast, gain an additional 5 temporary HP per turn per spell slot level above 1st.",
    "debuff": ""
  },
  {
    "name": "Hex",
    "description": "Curse a creature so it takes additional damage whenever you attack it and to inflict Disadvantage on Ability Checks with an Ability of your choosing.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "1d6 Necrotic (when you attack the target)",
    "buff": "",
    "debuff": "Target suffers Disadvantage on chosen Ability Checks and takes bonus Necrotic damage from your attacks. Lasts until Long Rest. Requires Concentration. When upcast, duration extends."
  },
  {
    "name": "Sleep",
    "description": "Put creatures into a magical slumber. Select targets up to a combined 24 hit points.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Creatures with total HP up to 24 fall asleep for 2 turns. When upcast, affect an additional 7 HP worth of creatures per spell slot level above 1st."
  },
  {
    "name": "Tasha's Hideous Laughter",
    "description": "Inflict a creature with fits of laughter, leaving it Prone without the ability to get up.",
    "school": "Enchantment",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Target falls Prone and is Incapacitated for 10 turns. Requires Concentration. When upcast, target an additional creature per spell slot level above 1st."
  },
  {
    "name": "Calm Emotions",
    "description": "Humanoids can't be Charmed, Frightened, or become enraged.",
    "school": "Enchantment",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Allies in area become immune to being Charmed or Frightened for 10 turns.",
    "debuff": "Enemies in area cannot be enraged. Requires Concentration."
  },
  {
    "name": "Crown of Madness",
    "description": "Instil madness in a humanoid enemy, making them attack the creature closest to them (other than you), even if it's allied.",
    "school": "Enchantment",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Target humanoid attacks the nearest creature (excluding caster) for 3 turns. Requires Concentration."
  },
  {
    "name": "Enthrall",
    "description": "Reduce a creature's peripheral vision and make it look at you.",
    "school": "Enchantment",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Target has Disadvantage on Perception checks for 10 turns. Requires Concentration."
  },
  {
    "name": "Hold Person",
    "description": "Hold a humanoid enemy still. They can't move, act or react. Attacks from within 3m are always Critical Hits.",
    "school": "Enchantment",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Target humanoid is Paralyzed for 10 turns. Attacks from within 3m are automatic Critical Hits. Requires Concentration. When upcast, target an additional humanoid per spell slot level above 2nd."
  },
  {
    "name": "Confusion",
    "description": "Befuddle a group of creatures, causing them to attack at random, wander around aimlessly, and occasionally skip turns in the stupor.",
    "school": "Enchantment",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Creatures in area become Confused for 3 turns, acting randomly. Requires Concentration. When upcast, increase the radius."
  },
  {
    "name": "Dominate Beast",
    "description": "Make a beast fight alongside you. Every time the beast takes damage, it makes a Wisdom Saving Throw against your domination.",
    "school": "Enchantment",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "",
    "buff": "Summons a dominated beast ally for 10 turns.",
    "debuff": "Target beast is Charmed and fights for you. When upcast at 5th level, duration extends to 10 turns with Concentration. At 6th level, duration extends to Long Rest with Concentration."
  },
  {
    "name": "Dominate Person",
    "description": "Make a humanoid fight alongside you. Every time the creature takes damage, it makes a Wisdom Saving Throw against your domination. Allies cannot be dominated.",
    "school": "Enchantment",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "",
    "buff": "Summons a dominated humanoid ally for 10 turns.",
    "debuff": "Target humanoid is Charmed and fights for you. When upcast at 6th level, duration extends to Long Rest with Concentration."
  },
  {
    "name": "Hold Monster",
    "description": "Paralyse a creature. It can't move, act or react. Attacks from within 3m are always Critical Hits.",
    "school": "Enchantment",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Target creature is Paralyzed for 10 turns. Attacks from within 3m are automatic Critical Hits. Requires Concentration. When upcast, target an additional creature per spell slot level above 5th."
  },
  {
    "name": "Otto's Irresistible Dance",
    "description": "Cause a creature to start dancing, making it unable to take actions or move. Its attackers have Advantage on Attack Rolls.",
    "school": "Enchantment",
    "type": "spell",
    "level": 6,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Target is forced to dance for 10 turns, unable to take actions or move. Attackers have Advantage on Attack Rolls against it. Target has Disadvantage on Attack Rolls and Dexterity Saving Throws. Requires Concentration."
  }
]