[
  {
    "name": "Minor Illusion",
    "description": "Create an illusory image that distracts nearby creatures, compelling them to investigate.",
    "school": "Illusion",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Creates a silent image to distract creatures. Can be cast while hidden.",
    "debuff": "Nearby creatures are compelled to investigate the illusion."
  },
  {
    "name": "Improved Minor Illusion",
    "description": "You can cast Minor Illusion as a bonus action. You can remain hidden while casting this spell. This spell can be cast while you are Silenced.",
    "school": "Illusion",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Creates a silent image as a bonus action. Can be cast while hidden or silenced.",
    "debuff": "Nearby creatures are compelled to investigate the illusion."
  },
  {
    "name": "Colour Spray",
    "description": "Blind creatures up to a combined 33 hit points.",
    "school": "Illusion",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Creatures with total HP up to 33 are Blinded for 1 turn. When upcast, affects an additional 2d6 HP worth of creatures per spell slot level above 1st."
  },
  {
    "name": "Disguise Self",
    "description": "Magically change all aspects of your appearance. Lasts until Long Rest.",
    "school": "Illusion",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Caster can change appearance (race, gender, appearance) until Long Rest. Useful for dialogue and infiltration.",
    "debuff": ""
  },
  {
    "name": "Shapeshift",
    "description": "Magically change all aspects of your appearance.",
    "school": "Illusion",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Caster can change appearance.",
    "debuff": ""
  },
  {
    "name": "Blur",
    "description": "Your body becomes blurred. Attackers have Disadvantage on Attack Rolls against you. Doesn't affect creatures that don't rely on sight or that can see through illusions.",
    "school": "Illusion",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains Disadvantage on attack rolls against them for 10 turns.",
    "debuff": "",
    "concentration": true
  },
  {
    "name": "Invisibility",
    "description": "Touch a creature to turn it Invisible. Attacks against it have Disadvantage. It attacks with Advantage. The spell ends early if the creature attacks or casts a spell.",
    "school": "Illusion",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "",
    "buff": "Target becomes Invisible for 10 turns. Attacks against it have Disadvantage; its attacks have Advantage.",
    "debuff": "",
    "concentration": true
  },
  {
    "name": "Mirror Image",
    "description": "Create 3 illusory duplicates of yourself that distract attackers. Each duplicate increases your Armour Class by 3. Whenever you successfully evade an attack, one of the duplicates disappears.",
    "school": "Illusion",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Caster gains +3 AC from duplicates for 10 turns. Each hit that would hit destroys one duplicate instead.",
    "debuff": ""
  },
  {
    "name": "Phantasmal Force",
    "description": "Flood a creature's mind with an illusion. Each turn, it takes 1d6 Psychic damage. The damage type changes to match the last type of damage the creature suffered.",
    "school": "Illusion",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "1d6 Psychic per turn",
    "buff": "",
    "debuff": "Target takes ongoing psychic damage for 10 turns. Damage type adapts to other damage taken. Requires Concentration.",
    "concentration": true
  },
  {
    "name": "Shadow Blade",
    "description": "Weave a shadowy shortsword in your hand that deals 2d8 Psychic damage. When you attack a target in dim light or darkness, you make the Attack Roll with Advantage. Lasts until Long Rest or until concentration is broken.",
    "school": "Illusion",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "2d8 Psychic (melee spell attack)",
    "buff": "Creates a shadowy shortsword that deals psychic damage and grants Advantage in dim light/darkness.",
    "debuff": "",
    "concentration": true
  },
  {
    "name": "Silence",
    "description": "Create a sound-proof sphere. All within are Silenced and Immune to Thunder damage. Using this spell might turn targets hostile.",
    "school": "Illusion",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Can protect allies from Thunder damage and sound-based effects.",
    "debuff": "Creates a sphere where creatures are Silenced (cannot cast spells with verbal components). Lasts 100 turns. Requires Concentration.",
    "concentration": true
  },
  {
    "name": "Fear",
    "description": "Project an image so frightening it makes targets drop everything and become Fearful. They have Disadvantage on Ability Checks and Attack Rolls and cannot move. If the target ends their turn where they can't see you, they can make another Saving Throw.",
    "school": "Illusion",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Targets in a cone become Frightened for 3 turns, dropping weapons and unable to move. Requires Concentration. When upcast, affects additional creatures.",
    "concentration": true
  },
  {
    "name": "Hypnotic Pattern",
    "description": "Hypnotise creatures that can see the pattern. They cannot attack, move, or act. The effect ends if the creature takes damage, is Shoved, or receives Help.",
    "school": "Illusion",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "",
    "buff": "",
    "debuff": "Creatures in the area become Hypnotised for 2 turns, unable to act. Requires Concentration. When upcast, affects additional creatures.",
    "concentration": true
  },
  {
    "name": "Greater Invisibility",
    "description": "Turn a creature Invisible. Attacks against it have Disadvantage. It attacks with Advantage. Unlike regular Invisibility, this spell allows the target to attack or cast spells without breaking invisibility, though they must make increasingly difficult Stealth checks.",
    "school": "Illusion",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Target becomes Invisible for 10 turns. Can attack and cast spells while remaining invisible.",
    "debuff": "",
    "concentration": true
  },
  {
    "name": "Phantasmal Killer",
    "description": "Haunt a creature with illusions of its greatest fears. It takes 4d10 Psychic damage per turn, cannot move, and has Disadvantage on Ability Checks and Attack Rolls.",
    "school": "Illusion",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "4d10 Psychic per turn",
    "buff": "",
    "debuff": "Target is Frightened, cannot move, takes heavy psychic damage each turn. Requires Concentration. When upcast, deals an additional 1d10 Psychic damage per spell slot level above 4th.",
    "concentration": true
  },
  {
    "name": "Seeming",
    "description": "Disguise up to 4 members of your adventuring party. Unlike Disguise Self, this can target multiple creatures at once.",
    "school": "Illusion",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "",
    "buff": "Up to 4 allies gain disguises (appearance changes) for 10 turns. Requires Concentration. When upcast, affects additional creatures.",
    "debuff": "",
    "concentration": true
  }
]