[
  {
    "name": "Acid Splash",
    "description": "Hurl a bubble of acid that deals 1d6 Acid damage to each creature it hits in a small area.",
    "school": "Conjuration",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "1d6 Acid",
    "buff": "",
    "debuff": ""
  },
  {
    "name": "Mage Hand",
    "description": "Create a spectral hand that can manipulate and interact with objects.",
    "school": "Conjuration",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "",
    "buff": "Summons an invisible hand that can interact with objects, use items, and throw things for 10 turns.",
    "debuff": ""
  },
  {
    "name": "Poison Spray",
    "description": "Project a puff of noxious gas that deals 1d12 Poison damage.",
    "school": "Conjuration",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "1d12 Poison",
    "buff": "",
    "debuff": ""
  },
  {
    "name": "Produce Flame",
    "description": "A flickering flame appears in your hand. It sheds bright light in a 9m / 30ft radius and deals 1d8 Fire damage when thrown.",
    "school": "Conjuration",
    "type": "spell",
    "level": 0,
    "upcastable": false,
    "damage": "1d8 Fire (when thrown)",
    "buff": "Provides light in a 9m / 30ft radius.",
    "debuff": ""
  },
  {
    "name": "Arms of Hadar",
    "description": "Call forth tendrils of dark energy that deal 2d6 Necrotic damage and prevent targets from taking Reactions.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "2d6 Necrotic",
    "buff": "",
    "debuff": "Targets cannot take Reactions until their next turn."
  },
  {
    "name": "Ensnaring Strike",
    "description": "Your attack summons thorny vines, dealing weapon damage and possibly Ensnaring your target. Ensnared creatures cannot move and take 1d6 Piercing damage at the start of each turn.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "Weapon damage + 1d6 Piercing (ongoing)",
    "buff": "",
    "debuff": "Target may become Ensnared, unable to move and taking ongoing Piercing damage. An ally can use Help to free them."
  },
  {
    "name": "Entangle",
    "description": "Vines sprout from the ground, turning it into Difficult Terrain and possibly Entangling creatures within. Entangled creatures cannot move.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Creatures in area may become Entangled (cannot move). Area is Difficult Terrain. Requires Concentration."
  },
  {
    "name": "Find Familiar",
    "description": "Summon a familiar, a fey spirit that takes an animal form of your choosing.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "Varies by familiar (typically 1-4 damage)",
    "buff": "Summons an animal companion that can fight, scout, and provide utility out of combat.",
    "debuff": ""
  },
  {
    "name": "Fog Cloud",
    "description": "Create a cloud of dense fog that Heavily Obscures and Blinds creatures within.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "Can obscure your party from enemy ranged attacks.",
    "debuff": "Creates an area that Heavily Obscures and Blinds creatures inside. Requires Concentration."
  },
  {
    "name": "Grease",
    "description": "Cover the ground in grease, slowing creatures within and possibly making them fall Prone.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Area becomes Difficult Terrain. Creatures may fall Prone (Dex Save). The grease is flammable."
  },
  {
    "name": "Hail of Thorns",
    "description": "Shoot a volley of thorns that deals weapon damage to the target and explodes, dealing an additional 1d10 Piercing damage to the target and surrounding creatures.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "Weapon damage + 1d10 Piercing (AoE)",
    "buff": "",
    "debuff": ""
  },
  {
    "name": "Ice Knife",
    "description": "Throw a shard of ice that deals 1d10 Piercing damage. It explodes and deals 2d6 Cold damage to anyone nearby, leaving an ice surface.",
    "school": "Conjuration",
    "type": "spell",
    "level": 1,
    "upcastable": true,
    "damage": "1d10 Piercing + 2d6 Cold (AoE)",
    "buff": "",
    "debuff": "Creates an ice surface that may cause creatures to fall Prone."
  },
  {
    "name": "Cloud of Daggers",
    "description": "Conjure a cloud of spinning daggers that attack anyone inside, dealing 4d4 Slashing damage each turn.",
    "school": "Conjuration",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "4d4 Slashing per turn",
    "buff": "",
    "debuff": "Creates a damaging area that lasts for 10 turns."
  },
  {
    "name": "Flaming Sphere",
    "description": "Summon a flaming sphere that deals 2d6 Fire damage to nearby enemies and objects. You can move the sphere. It sheds bright light.",
    "school": "Conjuration",
    "type": "spell",
    "level": 2,
    "upcastable": true,
    "damage": "2d6 Fire (when ramming enemies)",
    "buff": "Summons a controllable sphere that provides light and damages enemies. Requires Concentration.",
    "debuff": ""
  },
  {
    "name": "Misty Step",
    "description": "Surrounded by silver mist, you teleport to an unoccupied space you can see within 18m / 60ft.",
    "school": "Conjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "Allows the caster to instantly teleport to a nearby, visible location as a Bonus Action.",
    "debuff": ""
  },
  {
    "name": "Web",
    "description": "Cover an area in thick, flammable webbing that can Enweb creatures within, preventing them from moving.",
    "school": "Conjuration",
    "type": "spell",
    "level": 2,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Creates webbing that slows creatures and may Enweb them. The webbing is flammable. Requires Concentration."
  },
  {
    "name": "Call Lightning",
    "description": "Call down lightning to hit all targets within range for 3d10 Lightning damage. Then for 10 turns, you can call down lightning again without expending a spell slot.",
    "school": "Conjuration",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "3d10 Lightning",
    "buff": "",
    "debuff": "Requires Concentration."
  },
  {
    "name": "Conjure Barrage",
    "description": "Channel your weapon's essence into a destructive, widespread volley, dealing weapon damage plus an additional 2d8 damage of the same type to enemies in a cone.",
    "school": "Conjuration",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "Weapon damage + 2d8 (same type as weapon)",
    "buff": "",
    "debuff": ""
  },
  {
    "name": "Hunger of Hadar",
    "description": "Creatures within this black sphere are Blinded and take damage. Creatures starting their turn in the area take 2d6 Cold damage. Creatures ending their turn in the area possibly take 2d6 Acid damage. The area is Difficult Terrain.",
    "school": "Conjuration",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "2d6 Cold (start of turn) + 2d6 Acid (end of turn)",
    "buff": "",
    "debuff": "Creates an area that Blinds creatures, damages them, and is Difficult Terrain. Requires Concentration."
  },
  {
    "name": "Sleet Storm",
    "description": "Call forth a storm that douses fires, creates an ice surface, and forces spellcasters to make Concentration saves. Ice surfaces may cause creatures to fall Prone.",
    "school": "Conjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Creates ice surface (Difficult Terrain, may cause Prone). Disrupts Concentration. Requires Concentration."
  },
  {
    "name": "Spirit Guardians",
    "description": "Call forth spirits to protect you. Nearby enemies take 3d8 Radiant or Necrotic damage per turn, and their Movement Speed is halved.",
    "school": "Conjuration",
    "type": "spell",
    "level": 3,
    "upcastable": true,
    "damage": "3d8 Radiant or Necrotic per turn",
    "buff": "Protects the caster with spirits that damage nearby enemies.",
    "debuff": "Enemies in range have their Movement Speed halved. Requires Concentration."
  },
  {
    "name": "Stinking Cloud",
    "description": "Create a cloud of gas so nauseating it prevents creatures from taking actions if they fail a Constitution Saving Throw.",
    "school": "Conjuration",
    "type": "spell",
    "level": 3,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Creates a cloud that may prevent creatures from taking actions. Requires Concentration."
  },
  {
    "name": "Conjure Minor Elemental",
    "description": "Conjure a minor elemental to fight alongside you. Choose between an Azer, two Ice Mephits, or two Mud Mephits.",
    "school": "Conjuration",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "Varies by summon (Azer: 1d10+3 Bludgeoning +1d6 Fire; Ice Mephits: 1d4+1 Slashing +2d6 Cold; Mud Mephits: 3d6+1 Bludgeoning)",
    "buff": "Summons elemental allies that fight for you.",
    "debuff": "Summons may apply conditions: Ice Mephits can create ice surfaces; Mud Mephits can Restrain enemies."
  },
  {
    "name": "Conjure Woodland Being",
    "description": "Conjure a dryad to fight alongside you. She can use Nature's Step, Entangle enemies, and summon a Wood Woad.",
    "school": "Conjuration",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "Varies by summon",
    "buff": "Summons a dryad ally with powerful support and summoning abilities.",
    "debuff": "Dryad can Entangle enemies."
  },
  {
    "name": "Dimension Door",
    "description": "Teleport yourself and up to one adjacent ally to a place you can see. The ally cannot be larger than Medium.",
    "school": "Conjuration",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "Allows the caster and one ally to teleport to any visible location.",
    "debuff": ""
  },
  {
    "name": "Evard's Black Tentacles",
    "description": "Tentacles sprout from the ground, turning the area into Difficult Terrain, attacking and Smothering creatures within.",
    "school": "Conjuration",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "Ongoing damage to creatures in area",
    "buff": "",
    "debuff": "Creates an area of tentacles that damage and Restrain creatures. Requires Concentration."
  },
  {
    "name": "Grasping Vine",
    "description": "Summon a giant vine capable of dragging creatures toward itself.",
    "school": "Conjuration",
    "type": "spell",
    "level": 4,
    "upcastable": false,
    "damage": "",
    "buff": "",
    "debuff": "Vine pulls creatures toward it. Requires Concentration."
  },
  {
    "name": "Guardian of Faith",
    "description": "Call forth a divine guardian that attacks nearby enemies. Every time it deals damage, the guardian loses an equal amount of hit points.",
    "school": "Conjuration",
    "type": "spell",
    "level": 4,
    "upcastable": true,
    "damage": "20 Radiant per attack",
    "buff": "Summons a stationary guardian that attacks enemies that come near.",
    "debuff": ""
  },
  {
    "name": "Cloudkill",
    "description": "Craft a large cloud that inflicts 5d8 Poison damage per turn. You can reposition the cloud every turn. The cloud Heavily Obscures everything within it.",
    "school": "Conjuration",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "5d8 Poison per turn",
    "buff": "",
    "debuff": "Creates a movable poison cloud that damages and obscures. Requires Concentration."
  },
  {
    "name": "Conjure Elemental",
    "description": "Bend the barrier between the Planes until they disgorge an elemental ally to follow and fight for you. Choose from Air, Earth, Fire, or Water Elementals, or their more powerful Myrmidon forms.",
    "school": "Conjuration",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "Varies by elemental (typically 2d8 + elemental damage)",
    "buff": "Summons a powerful elemental ally to fight for you.",
    "debuff": "Elementals can apply various conditions (Burn, Chilled, Prone, etc.). Requires Concentration."
  },
  {
    "name": "Insect Plague",
    "description": "Locusts attack everyone within range, deal 4d10 Piercing damage, make the area Difficult Terrain, and impose Disadvantage on Perception Checks.",
    "school": "Conjuration",
    "type": "spell",
    "level": 5,
    "upcastable": true,
    "damage": "4d10 Piercing",
    "buff": "",
    "debuff": "Creates a damaging area that is Difficult Terrain and impairs Perception. Requires Concentration."
  },
  {
    "name": "Arcane Gate",
    "description": "Create two linked teleportation portals within range. All creatures, including enemies, may travel between the two portals as a free action.",
    "school": "Conjuration",
    "type": "spell",
    "level": 6,
    "upcastable": false,
    "damage": "",
    "buff": "Creates portals for strategic movement and positioning.",
    "debuff": ""
  },
  {
    "name": "Heroes' Feast",
    "description": "You and everyone around can't be Poisoned, Diseased, or Frightened. Maximum Hit Points increase by 2d10, and they make Wisdom Saving Throws with Advantage.",
    "school": "Conjuration",
    "type": "spell",
    "level": 6,
    "upcastable": false,
    "damage": "",
    "buff": "Allies gain immunity to Poison, Disease, and Frightened; +2d10 max HP; Advantage on Wisdom Saves.",
    "debuff": ""
  },
  {
    "name": "Planar Ally",
    "description": "Beseech one of these otherworldly entities for aid. Summon either a Deva, Djinni, or Cambion to fight for you until a Long Rest.",
    "school": "Conjuration",
    "type": "spell",
    "level": 6,
    "upcastable": false,
    "damage": "Varies by ally",
    "buff": "Summons a powerful celestial, elemental, or fiendish ally to fight for you until Long Rest.",
    "debuff": "Allies can apply various conditions to enemies."
  },
  {
    "name": "Wall of Thorns",
    "description": "Create a wall of pliable, twisting thorns. Creatures can move through the wall, but take 7d8 Piercing damage per turn, their Movement Speed is quartered, and they may become Entangled.",
    "school": "Conjuration",
    "type": "spell",
    "level": 6,
    "upcastable": true,
    "damage": "7d8 Piercing per turn (when moving through)",
    "buff": "",
    "debuff": "Creates a damaging barrier that slows movement and may Entangle. Requires Concentration."
  }
]